{
    "2022": {
        "acts": [
            {
                "url": "https://www.irishstatutebook.ie/eli/2022/act/1/enacted/en/xml",
                "title": "ELECTRICITY COSTS (DOMESTIC ELECTRICITY ACCOUNTS) EMERGENCY MEASURES ACT 2022",
                "description": "An Act to make provision, due to the exceptional rise in global energy prices, for the establishment of a scheme to be known as the Electricity Costs Emergency Benefit Scheme for the purpose of making, on a once-off basis, an electricity costs emergency benefit payment in the year ending 31 December 2022 in respect of domestic electricity accounts in accordance with this Act out of resources available to the Minister for the Environment, Climate and Communications; for that purpose to confer functions on the distribution system operator and electricity suppliers; to confer functions on the Commission for Regulation of Utilities in relation to the Scheme and for that purpose to amend the Electricity Regulation Act 1999; to provide that electricity costs emergency benefit payments are exempt from income tax and for that purpose to amend the Taxes Consolidation Act 1997; to enable the Minister for the Environment, Climate and Communications to make regulations in relation to the operation of the Scheme; and to provide for related matters.",
                "details": "2. \nEstablishment of Scheme\n Establishment of Scheme Establishment of Scheme 2. (1) On the coming into operation of this section there shall stand established a scheme to be known as the Electricity Costs Emergency Benefit Scheme to be operated in accordance with this Act and any regulations made thereunder. 2. (2) The Scheme is established for the purpose of making, on a once-off basis, an electricity costs emergency benefit payment in the year ending 31 December 2022 in accordance with this Act and any regulations made thereunder out of resources allocated for the purposes of the Scheme under subsection (3). subsection (3) (3) (a) The Minister shall, out of such monies as are available to him or her from monies provided by the Oireachtas, and with the consent of the Minister for Public Expenditure and Reform, allocate such amount as he or she determines for the purposes of the Scheme. (b) The amount allocated under paragraph (a) shall not exceed 400 million. paragraph (a)  (c) The Minster shall estimate the amount required to be allocated under paragraph (a) for the purposes of making electricity costs emergency benefit payments under section 5(2) and, in so doing, the Minister shall have regard to the number of domestic electricity accounts notified to him or her by the distribution system operator in accordance with section 4(1)(b). paragraph (a) section 5(2) section 4(1)(b) (d) The Minister may request information additional to that notified to him or her in accordance with section 4(1)(b), including up-to-date information in relation to the number of domestic electricity accounts, from the distribution system operator for the purpose of allocating an amount under paragraph (a). section 4(1)(b) paragraph (a) (4) The Scheme shall be operated and administered by the distribution system operator and electricity suppliers in accordance with this Act and any regulations made thereunder. 3. \nTransfer of monies by Minister to distribution system operator for purposes of Scheme\n Transfer of monies by Minister to distribution system operator for purposes of Scheme Transfer of monies by Minister to distribution system operator for purposes of Scheme 3. (1) The Minister shall, as soon as practicable after he or she has been notified by the distribution system operator in accordance with section 4(1)(b), with the consent of the Minister for Public Expenditure and Reform, transfer to the distribution system operator, from the monies allocated under section 2, an amount to be used for the purposes of the Scheme. 3. section 4(1)(b) section 2 (2) The Minister may request information additional to that notified to him or her in accordance with section 4(1)(b), including up-to-date information in relation to the number of domestic electricity accounts, from the distribution system operator for the purpose of transferring an amount under subsection (1). section 4(1)(b) subsection (1) 4. \nOperation and administration of Scheme - functions of distribution system operator\n Operation and administration of Scheme - functions of distribution system operator Operation and administration of Scheme - functions of distribution system operator 4. (1) For the purposes of the operation and administration of the Scheme, the distribution system operator shall 4.  (a) on the request of the Minister, determine the number of domestic electricity accounts on such date (in this Act referred to as the relevant date) as the Minister may, with the consent of the Minister for Public Expenditure and Reform, prescribe for the purposes of this paragraph,   (b) as soon as practicable after it has made its determination under paragraph (a), notify the Minister of that determination, paragraph (a) (c) provide the Minister with any additional information requested by the Minister under section 2(3)(d) or 3(2), section 2(3)(d) 3(2) (d) receive monies transferred to it by the Minister under section 3 for the purpose of the distribution system operator transferring those monies to electricity suppliers in accordance with paragraph (f), section 3 paragraph (f) (e) subject to subsection (3), on such date (in this Act referred to as the effective date) as the Minister, with the consent of the Minister for Public Expenditure and Reform, prescribes for the purposes of this paragraph, notify each electricity supplier of subsection (3)    (i) the assigned meter point registration number for each domestic electricity account by reference to which the electricity supplier concerned supplies electricity, and (ii) the amount of monies to be transferred by the distribution system operator to the supplier concerned under paragraph (f), paragraph (f) (f) transfer to each supplier, within the prescribed period, out of monies received by it from the Minister in accordance with paragraph (d), the amount of monies notified to the electricity supplier concerned under paragraph (e)(ii) to be used by the supplier in accordance with section 5(1)(b), paragraph (d) paragraph (e)(ii) section 5(1)(b) (g) keep records of all monies transferred to electricity suppliers under paragraph (f), paragraph (f) (h) receive monies repaid to it by electricity suppliers under section 5(1)(d), section 5(1)(d) (i) as soon as practicable, repay to the Minister  (i) any monies received by it from the Minister in accordance with paragraph (d) that are not required to be transferred to electricity suppliers in accordance with paragraph (f), and paragraph (d) paragraph (f) (ii) any monies repaid to it by electricity suppliers under section 5(1)(d), section 5(1)(d) (j) perform such other functions as the Minister, with the consent of the Minister for Public Expenditure and Reform, may, for the purposes of the efficient operation and administration of the Scheme, prescribe, and (k) make available to an auditor appointed by the Minister all books and records in relation to the performance by the distribution system operator of the functions conferred on it by or under this Act. (2) The distribution system operator shall put in place such administrative and operational arrangements that the Commission considers necessary or expedient under section 9P(1)(a) of the Act of 1999. (3) The date to be prescribed for the purposes of subsection (1)(e) shall be prescribed once and once only and shall subsection (1)(e)  (a) be a date that is not earlier than the date of receipt of monies by the distribution system operator in accordance with subsection (1)(d), and subsection (1)(d) (b) be a date during the year ending 31 December 2022. (4) In this section, prescribed period means such period as the Minister, with the consent of the Minister for Public Expenditure and Reform, prescribes for the purposes of subsection (1)(f).   subsection (1)(f) 5. \nOperation and administration of Scheme - functions of electricity suppliers\n Operation and administration of Scheme - functions of electricity suppliers Operation and administration of Scheme - functions of electricity suppliers 5. (1) For the purposes of the operation and administration of the Scheme, an electricity supplier shall 5.  (a) receive monies transferred to it by the distribution system operator under section 4(1)(f), section 4(1)(f) (b) use monies received by it under paragraph (a) for the sole purpose of making electricity costs emergency benefit payments, paragraph (a) (c) keep records of  (i) all monies received in accordance with paragraph (a), and paragraph (a) (ii) all electricity costs emergency benefit payments made by it, (d) as soon as practicable, repay to the distribution system operator any monies received by it in accordance with paragraph (a) that have not been used for the purpose of making electricity costs emergency benefit payments and keep records of any such repayments, paragraph (a) (e) perform such other functions as the Minster may, with the consent of the Minister for Public Expenditure and Reform, for the purposes of the efficient operation and administration of the Scheme, prescribe, and (f) make available to an auditor appointed by the Minister all books and records in relation to the performance by the electricity supplier of the functions conferred on it by or under this Act. (2) Where an electricity supplier receives monies in accordance with subsection (1)(a), it shall, within such period as the Minister, with the consent of the Minister for Public Expenditure and Reform, prescribes for the purposes of this subsection, credit each domestic electricity account held with it on the effective date, with a payment of 176.22 (in this Act referred to as an electricity costs emergency benefit payment). subsection (1)(a)    (3) An electricity supplier shall put in place such administrative and operational arrangements that the Commission considers necessary or expedient under section 9P(1)(a) of the Act of 1999. 6. \nFunctions of Commission in relation to Scheme\n Functions of Commission in relation to Scheme Functions of Commission in relation to Scheme 6. Section 9 of the Act of 1999 is amended by the insertion of the following section after section 9O: 6. Functions of Commission in relation to Electricity Costs Emergency Benefit Scheme Functions of Commission in relation to Electricity Costs Emergency Benefit Scheme  9P. (1) The following shall be functions of the Commission: 9P. (a) to ensure that the distribution system operator and electricity suppliers have in place such administrative and operational arrangements that the Commission considers necessary or expedient for the performance by them of the respective functions conferred on them by or under the Act of 2022 for the purpose of the efficient operation of the Electricity Costs Emergency Benefit Scheme; Act of 2022 (b) to take such steps as are necessary to ensure the distribution system operator and electricity suppliers perform the respective functions conferred on them by or under the Act of 2022; Act of 2022 (c) to report to the Minister, at such intervals as are agreed by the Commission and the Minister, in relation to the performance by the distribution system operator and electricity suppliers of the respective functions conferred on them by or under the Act of 2022. Act of 2022 (2) In this section, Act of 2022 means the Electricity Costs (Domestic Electricity Accounts) Emergency Measures Act 2022..   Electricity Costs (Domestic Electricity Accounts) Emergency Measures Act 2022.  7. \nExemption in respect of electricity costs emergency benefit payment\n Exemption in respect of electricity costs emergency benefit payment Exemption in respect of electricity costs emergency benefit payment 7. The Taxes Consolidation Act 1997 is amended by the insertion of the following section after section 192I: 7. Exemption in respect of electricity costs emergency benefit payment Exemption in respect of electricity costs emergency benefit payment  192J. (1) An electricity costs emergency benefit payment made under section 5(2) of the Electricity Costs (Domestic Electricity Accounts) Emergency Measures Act 2022 on or after 1 January 2022 and on or before 31 December 2022 shall be exempt from income tax and shall not be reckoned in computing total income for the purposes of the Income Tax Acts. 192J. section 5(2) Electricity Costs (Domestic Electricity Accounts) Emergency Measures Act 2022 (2) In this section, electricity costs emergency benefit payment has the same meaning as it has in the Electricity Costs (Domestic Electricity Accounts) Emergency Measures Act 2022..   Electricity Costs (Domestic Electricity Accounts) Emergency Measures Act 2022  8. \nRegulations\n Regulations Regulations 8. (1) The Minister may, with the consent of the Minister for Public Expenditure and Reform, make regulations for the purposes of this Act, including regulations for prescribing any matter or thing which is referred to in this Act as prescribed or to be prescribed, for the purpose of enabling any provision of this Act to have full effect or for the purpose of the efficient operation of the Scheme. 8. (2) Without prejudice to the generality of subsection (1), the Minister shall make regulations under this section providing for subsection (1)  (a) the date for the purposes of section 4(1)(a), section 4(1)(a) (b) the date for the purposes of section 4(1)(e), section 4(1)(e) (c) the period for the purposes of section 4(1)(f), and section 4(1)(f) (d) the period for the purposes of section 5(2). section 5(2) (3) Without prejudice to the generality of subsection (1), the Minister may make regulations under this section providing for subsection (1)  (a) functions of the distribution system operator for the purposes of the efficient operation and administration of the Scheme, (b) functions of electricity suppliers for the purposes of the efficient operation and administration of the Scheme, and (c) such administrative and operational matters as the Minister considers appropriate for the purposes of the efficient operation and administration of the Scheme. (4) Regulations under this section may contain such incidental or supplementary provisions that appear to the Minister, with the consent of the Minister for Public Expenditure and Reform, to be expedient for the purposes of the regulations. (5) Every regulation made by the Minister under this section shall be laid before each House of the Oireachtas as soon as may be after it is made and, if a resolution annulling the regulation is passed by either such House within the next 21 days on which that House sits after the regulation is laid before it, the regulation shall be annulled accordingly but without prejudice to the validity of anything previously done thereunder. 9. \nExpenses\n Expenses Expenses 9. (1) The expenses incurred by the Minister in the administration of this Act shall, to such extent as may be sanctioned by the Minister for Public Expenditure and Reform, be paid out of monies provided by the Oireachtas. 9. (2) Expenses incurred by the distribution system operator and electricity suppliers in relation to the operation and administration of the Scheme shall be borne by the distribution system operator and electricity suppliers, as the case may be. 10. \nShort title and commencement\n Short title and commencement Short title and commencement 10. (1) This Act may be cited as the Electricity Costs (Domestic Electricity Accounts) Emergency Measures Act 2022. 10. (2) This Act shall come into operation on such day or days as the Minister may appoint by order or orders either generally or with reference to any particular purpose or provision and different days may be so appointed for different purposes or provisions."
            },
            {
                "url": "https://www.irishstatutebook.ie/eli/2022/act/2/enacted/en/xml",
                "title": "Sea-Fisheries (Miscellaneous Provisions) Act 2022",
                "details": " 1. \nDefinition\n Definition Definition 1. In this Act, Act of 2006 means the Sea-Fisheries and Maritime Jurisdiction Act 2006. 1.   2. \nAmendment of section 2 of Act of 2006\n Amendment of section 2 of Act of 2006 Amendment of section 2 of Act of 2006 2. Section 2 of the Act of 2006 is amended 2.  (a) in the definition of Department, by the substitution of Department of Agriculture, Food and the Marine; for Department of Communications, Marine and Natural Resources;,       (b) in the definition of Minister, by the substitution of Minister for Agriculture, Food and the Marine; for Minister for Communications, Marine and Natural Resources;, and       (c) by the insertion of the following definition: fisheries monitoring centre has the same meaning as it has in Article 4 of Council Regulation (EC) No. 1224/2009 of 20 November 200933 OJ No. L 343, 22.12.2009, p. 1;.    33 OJ No. L 343, 22.12.2009, p. 1 3 3 3 OJ No. L 343, 22.12.2009, p. 1 3 OJ No. L 343, 22.12.2009, p. 1 3  3. \nAmendment of section 12 of Act of 2006\n Amendment of section 12 of Act of 2006 Amendment of section 12 of Act of 2006 3. Section 12 of the Act of 2006 is amended by 3.  (a) the substitution of the following subsection for subsection (9): (9) Without prejudice to subsection (8), notification of the publication of a notice under that subsection shall be made by publishing a notification in Iris Oifigiil and such notification shall include the date on which, and manner in which, the notice was published.,    and (b) in subsection (10), by the substitution of notification for notice wherever it appears.     4. \nAmendment of section 13 of Act of 2006\n Amendment of section 13 of Act of 2006 Amendment of section 13 of Act of 2006 4. Section 13 of the Act of 2006 is amended 4.  (a) in subsection (1)  (i) by the substitution of the following paragraph for paragraph (a): (a) upon   (i) the application from any person, in such form as the Minister decides, or (ii) the Ministers own initiative, in respect of any person,  who  (I) is the owner of an Irish sea-fishing boat which is entered in the Register of Fishing Boats, and (II) to whom a sea-fishing boat licence has been granted, and,  and (ii) by the substitution of grant (in electronic form or otherwise) for grant,     (b) in subsection (2)(a), by the deletion of , charterer or hirer, as the case may be,, and   (c) in subsection (5), by the substitution of the following paragraph for paragraph (k): (k) requiring the keeping of the authorisation, or where the authorisation is issued in electronic form, a printed copy of the authorisation, on the boat concerned..   5. \nAmendment of section 15 of Act of 2006\n Amendment of section 15 of Act of 2006 Amendment of section 15 of Act of 2006 5. Section 15 of the Act of 2006 is amended 5.  (a) in subsection (1)(c), by the insertion of fishing or after any person engaged in, and     (b) in subsection (2)(a)(i), by the substitution of fishing gear or equipment, for equipment on them,.     6. \nRegulation of Irish fishing masters\n Regulation of Irish fishing masters Regulation of Irish fishing masters 6. Part 2 of the Act of 2006 is amended by the insertion of the following Chapter after Chapter 2: 6. Chapter 2A  Regulation of Irish fishing masters Regulation of Irish fishing masters Interpretation and application (Chapter 2A of Part 2) Interpretation and application (Chapter 2A of Part 2) 15A. (1) In this Chapter 15A.  Appeals Officer shall be construed in accordance with section 15M;   certificate of master registration shall be construed in accordance with section 15C(1);   Commission Regulation means Commission Implementing Regulation (EU) No. 404/2011 of 8 April 201144 OJ No. L169, 1.7.2015, p. 1 laying down detailed rules for the implementation of Council Regulation (EC) No. 1224/2009 of 20 November 200955 OJ No. L 343, 22.12.2009, p. 1 establishing a Community control system for ensuring compliance with the rules of the Common Fisheries Policy, as amended by Commission Implementing Regulation (EU) 2015/1962 of 28 October 201566 OJ No. L 287, 31.10.2015, p. 6, Commission Implementing Regulation (EU) 2020/30 of 14 January 202077 OJ No. L 9, 15.1.2020, p. 3 and Commission Implementing Regulation (EU) 2020/863 of 22 June 202088 OJ No. L 200, 24.06.2020, p. 1;   44 OJ No. L169, 1.7.2015, p. 1 4 4 4 OJ No. L169, 1.7.2015, p. 1 4 OJ No. L169, 1.7.2015, p. 1 4 55 OJ No. L 343, 22.12.2009, p. 1 5 5 5 OJ No. L 343, 22.12.2009, p. 1 5 OJ No. L 343, 22.12.2009, p. 1 5 66 OJ No. L 287, 31.10.2015, p. 6 6 6 6 OJ No. L 287, 31.10.2015, p. 6 6 OJ No. L 287, 31.10.2015, p. 6 6 77 OJ No. L 9, 15.1.2020, p. 3 7 7 7 OJ No. L 9, 15.1.2020, p. 3 7 OJ No. L 9, 15.1.2020, p. 3 7 88 OJ No. L 200, 24.06.2020, p. 1 8 8 8 OJ No. L 200, 24.06.2020, p. 1 8 OJ No. L 200, 24.06.2020, p. 1 8 competent authority means, in relation to another Member State, the competent authority designated by that Member State to perform the functions of the competent authority under the Control Regulation;   Control Regulation means Council Regulation (EC) No. 1224/2009 of 20 November 200999 OJ No. L 343, 22. 12. 2009, p. 1 establishing a Union control system for ensuring compliance with the rules of the common fisheries policy, as amended by Regulation (EU) No. 1379/2013 of the European Parliament and of the Council of 11 December 20131010 OJ No. L 354, 28.12.2013, p. 1, Regulation (EU) No. 1380/2013 of the European Parliament and of the Council of 11 December 20131111 OJ No. L 354, 28.12.2013, p. 22, Council Regulation (EU) No. 1385/2013 of 17 December 20131212 OJ No. L 354, 28.12.2013, p. 86, Regulation (EU) No. 508/2014 of the European Parliament and of the Council of 15 May 20141313 OJ No. L 149, 20.05.2014, p. 1, Regulation (EU) 2015/812 of the European Parliament and of the Council of 20 May 20151414 OJ No. L 133, 29.05.2015, p. 1, Regulation (EU) 2019/473 of the European Parliament and of the Council of 19 March 20191515 OJ No. L 83, 25.03.2019, p. 18 and Regulation (EU) 2019/1241 of the European Parliament and of the Council of 20 June 20191616 OJ No. L 198, 25.07.2019, p. 105;   99 OJ No. L 343, 22. 12. 2009, p. 1 9 9 9 OJ No. L 343, 22. 12. 2009, p. 1 9 OJ No. L 343, 22. 12. 2009, p. 1 9 1010 OJ No. L 354, 28.12.2013, p. 1 10 10 10 OJ No. L 354, 28.12.2013, p. 1 10 OJ No. L 354, 28.12.2013, p. 1 10 1111 OJ No. L 354, 28.12.2013, p. 22 11 11 11 OJ No. L 354, 28.12.2013, p. 22 11 OJ No. L 354, 28.12.2013, p. 22 11 1212 OJ No. L 354, 28.12.2013, p. 86 12 12 12 OJ No. L 354, 28.12.2013, p. 86 12 OJ No. L 354, 28.12.2013, p. 86 12 1313 OJ No. L 149, 20.05.2014, p. 1 13 13 13 OJ No. L 149, 20.05.2014, p. 1 13 OJ No. L 149, 20.05.2014, p. 1 13 1414 OJ No. L 133, 29.05.2015, p. 1 14 14 14 OJ No. L 133, 29.05.2015, p. 1 14 OJ No. L 133, 29.05.2015, p. 1 14 1515 OJ No. L 83, 25.03.2019, p. 18 15 15 15 OJ No. L 83, 25.03.2019, p. 18 15 OJ No. L 83, 25.03.2019, p. 18 15 1616 OJ No. L 198, 25.07.2019, p. 105 16 16 16 OJ No. L 198, 25.07.2019, p. 105 16 OJ No. L 198, 25.07.2019, p. 105 16 Determination Panel shall be construed in accordance with section 15G;   engage, in relation to a master of a sea-fishing boat, means    (a) retain, hire or otherwise employ the master concerned, or (b) enter into any other contractual or legal arrangement with the master concerned pursuant to which the master acts as master of a sea-fishing boat; Irish citizen means a person who    (a) is an Irish citizen under the Irish Nationality and Citizenship Acts 1956 to 2004, or (b) acquires Irish citizenship under those Acts or any other enactment; IUU Regulation means Council Regulation (EC) No. 1005/2008 of 29 September 20081717 OJ No. L 286, 29.10.2008, p. 1 establishing a Community system to prevent, deter and eliminate illegal, unreported and unregulated fishing, as amended by Commission Regulation (EC) No. 1010/2009 of 22 October 20091818 OJ No. L 280, 27.10.2009, p. 5, Commission Regulation (EU) No. 86/2010 of 29 January 20101919 OJ No. L 26, 30.01.2010, p. 1 and Commission Regulation (EU) No. 202/2011 of 1 March 20112020 OJ No. L 57, 02.03.2011, p. 10;   1717 OJ No. L 286, 29.10.2008, p. 1 17 17 17 OJ No. L 286, 29.10.2008, p. 1 17 OJ No. L 286, 29.10.2008, p. 1 17 1818 OJ No. L 280, 27.10.2009, p. 5 18 18 18 OJ No. L 280, 27.10.2009, p. 5 18 OJ No. L 280, 27.10.2009, p. 5 18 1919 OJ No. L 26, 30.01.2010, p. 1 19 19 19 OJ No. L 26, 30.01.2010, p. 1 19 OJ No. L 26, 30.01.2010, p. 1 19 2020 OJ No. L 57, 02.03.2011, p. 10 20 20 20 OJ No. L 57, 02.03.2011, p. 10 20 OJ No. L 57, 02.03.2011, p. 10 20 official has the same meaning as it has in Article 4(6) of the Control Regulation;   points means points assigned to a master of a sea-fishing boat for a serious infringement in accordance with Annex XXX to the Commission Regulation or section 15U, as the case may be;   registered master means an Irish citizen who is entered in the Irish Fishing Master Register in accordance with section 15B;   Regulations of 2020 means the European Union (Common Fisheries Policy) (Point System) Regulations 2020 (S.I. No. 318 of 2020);   report means a report in writing and includes an inspection report, a surveillance report, a report of control data or material, collected by an official acting in the execution of his or her powers or duties;   sea-fishing boat licence means a licence granted under section 4 (inserted by section 97) of the Act of 2003;   serious infringement means an infringement of the rules of the common fisheries policy specified in Annex XXX to the Commission Regulation or Article 90(1)(c) of the Control Regulation.   (2) A word or expression that is used in this Chapter and is also used in the Commission Regulation, the Control Regulation or the IUU Regulation has, unless the context otherwise requires, the same meaning in this Chapter as it has in the Commission Regulation, the Control Regulation or the IUU Regulation, as the case may be. (3) This Chapter is without prejudice to section 3 of the Merchant Shipping (Certification of Seamen) Act 1979 and any regulations made thereunder. Irish Fishing Master Register Irish Fishing Master Register 15B. (1) For the purposes of this Chapter, the Minister shall establish and maintain, in such form (including electronic form) as he or she considers appropriate, a register, to be known as the Irish Fishing Master Register, of Irish citizens who are masters of sea-fishing boats and the points assigned in accordance with this Chapter to each such master. 15B.   (2) A person applying for registration in the Irish Fishing Master Register shall  (a) furnish the Minister with such information as the Minister may reasonably require for the purposes of maintaining the Irish Fishing Master Register, and (b) without prejudice to the generality of paragraph (a), satisfy the Minister that he or she  (i) is an Irish citizen, and (ii) is not, at the time of registration, assigned 90 or more points in accordance with this Chapter. (3) An application for entry in the Irish Fishing Master Register shall be made in such form and manner as the Minister may specify. (4) The Irish Fishing Master Register shall contain the following details in respect of each person registered therein: (a) his or her name and address; (b) his or her phone number, email address and any other relevant contact details; (c) his or her personal public service number (within the meaning of section 262 of the Social Welfare Consolidation Act 2005); (d) his or her registration number as specified in the certificate of master registration issued in respect of him or her; (e) the date of registration on the certificate of master registration; (f) the number of points (if any) assigned to him or her by the Authority in accordance with this Chapter; (g) the date on which any such points were so assigned; (h) details of any suspension of the registration of the person in the Irish Fishing Master Register, including the date and duration of any such suspension, a summary of the reasons for the suspension and particulars of all deletions of such suspensions; (i) the date of occurrence and details of each serious infringement for which he or she has been assigned points (if any); (j) the date of the detection of each such serious infringement; (k) the date on which any points assigned to the master or any suspension of the registration of the master may be deleted from the Irish Fishing Master Register in accordance with section 15J(2) or 15K(6); (l) such other information as the Minister considers necessary to ensure the effective management of the Irish Fishing Master Register. (5) A registered master shall notify the Minister of any change in the details specified in paragraph (a) or (b) of subsection (4) relating to him or her. (6) The Minister shall make the following information entered in the Irish Fishing Master Register in relation to a person entered in that register available in such manner as he or she considers appropriate to holders of sea-fishing boat licences and other relevant persons: (a) his or her name; (b) his or her registration number; (c) the number of points assigned to him or her; (d) details of any suspension of the registration of the person in the Irish Fishing Master Register, including the date and duration of any such suspension. (7) An official shall, at all reasonable times, have access to and may inspect and examine the Irish Fishing Master Register. (8) Upon receipt of a notification under section 15I(3)(b) or section 15I(6)(b), the Minister shall record on the Irish Fishing Master Register the points assigned in accordance with this Chapter to the master to whom the notification relates. (9) Subject to subsection (10), the Minister may refuse to register a person in, or remove a person from, the Irish Fishing Master Register where the Minister is satisfied that the persons application for registration is or was, at the time it was made, incomplete, inaccurate, false or misleading in any material respect.  (10) Where the Minister proposes, in accordance with subsection (9), to refuse to register in, or to remove from, the Irish Fishing Master Register, a person, he or she shall  (a) notify the person concerned in writing of the proposal and of the reasons for the proposed refusal or removal, (b) notify the person in writing that he or she, or a person acting on his or her behalf, may make representations to the Minister in relation to the proposal within 14 days of the receipt by the person of the notification referred to in paragraph (a), and (c) consider any such representations duly made before deciding whether to refuse to register in, or to remove from, the Irish Fishing Master Register, the person. (11) The Minister shall retain a record, in such form (including electronic form) as he or she considers appropriate, of persons who have been removed from the Irish Fishing Master Register in accordance with subsection (9) or (13) or section 15L. (12) A person who, when applying for registration in the Irish Fishing Master Register, furnishes information to the Minister knowing it to be false or misleading in any material respect shall be guilty of an offence and shall be liable  (a) on summary conviction, to a class A fine, or (b) on conviction on indictment, to a fine not exceeding 15,000.  (13) Where a person is convicted of an offence under subsection (12), he or she shall be removed by the Minister from the Irish Fishing Master Register. (14) In this section, relevant person means    (a) a holder of a sea-fishing boat licence, and (b) a person who has made an application for a sea-fishing boat licence to the licensing authority and such licence has not yet been granted. Certificate of master registration Certificate of master registration 15C. (1) A certificate certifying that a person is entered in the Irish Fishing Master Register (a certificate of master registration) and specifying 15C.    (a) the registration number of the registered master, and (b) the date of registration of the person, shall be issued by the Minister in respect of each person so entered. (2) A master shall, at all times when he or she is acting as the master of a sea-fishing boat, carry his or her certificate of master registration on board the sea-fishing boat. (3) A person who fails to comply with subsection (2) commits an offence and is liable on summary conviction to a class A fine. Data entered in Irish Fishing Master Register Data entered in Irish Fishing Master Register 15D. (1) Subject to subsection (2), data entered in the Irish Fishing Master Register shall be stored only for as long as necessary for the operation of the Irish Fishing Master Register for the purposes of this Chapter. 15D. (2) Where data entered in the Irish Fishing Master Register concerns the points system referred to in Article 92 of the Control Regulation, such data shall be stored for a minimum of 3 years, starting from the year following the later of  (a) the year in which the data is entered in the Irish Fishing Master Register, or (b) the year in which the most recent points are assigned to the person to whom it relates. Regulations relating to maintenance and administration of Irish Fishing Master Register Regulations relating to maintenance and administration of Irish Fishing Master Register 15E. (1) The Minister may by regulations make provision for such additional, incidental, consequential or supplementary matters relating to the maintenance and proper administration of the Irish Fishing Master Register as appear to him or her to be necessary or expedient. 15E. (2) Without prejudice to the generality of subsection (1), regulations under that subsection may provide for  (a) the manner in which the Irish Fishing Master Register shall be maintained, and (b) the manner in which the Irish Fishing Master Register shall be operated to ensure compliance with Regulation (EU) 2016/679 of the European Parliament and of the Council of 27 April 20162121 OJ No. L 119, 4.5.2016, p.1.. 2121 OJ No. L 119, 4.5.2016, p.1. 21 21 21 OJ No. L 119, 4.5.2016, p.1. 21 OJ No. L 119, 4.5.2016, p.1. 21 Taking charge of certain sea-fishing boats when not registered in the Irish Fishing Master Register Taking charge of certain sea-fishing boats when not registered in the Irish Fishing Master Register 15F. (1) Subject to subsection (3), an Irish citizen shall not take charge, or attempt to take charge, of an Irish sea-fishing boat or a foreign sea‑fishing boat wherever it may be, unless he or she is for the time being registered in the Irish Fishing Master Register. 15F. (2) A person who contravenes subsection (1) commits an offence and is liable  (a) on summary conviction, to a class A fine, or (b) on conviction on indictment, to a fine not exceeding 15,000.  (3) In proceedings for an offence under subsection (2), it shall be a defence for the defendant to prove that he or she took charge of the Irish sea-fishing boat or the foreign sea-fishing boat in order to avert, or to seek to avert, an immediate or imminent danger to the boat or a person on the boat. Determination Panel Determination Panel 15G. (1) The Determination Panel established and appointed under and in accordance with Regulation 5 of the Regulations of 2020 shall be the Determination Panel for the purpose of determining, in accordance with this Chapter, whether a serious infringement has occurred and whether a person was, at the time, the master of the sea-fishing boat. 15G. (2) Paragraphs (2) to (14) of Regulation 5 of the Regulations of 2020 shall apply to a Determination Panel under this section, subject to the following modifications: (a) a reference to the Regulations of 2020 shall be construed as a reference to this Chapter; (b) a reference to a licence holder shall be construed as a reference to a master of a sea-fishing boat;   (c) a reference to a determination shall be construed as a reference to a determination under this Chapter;   (d) in paragraphs (8) and (9), the references to Regulation 6(6) shall be read as references to section 15H(2)(b); (e) in paragraph (11), the reference to Regulation 6(9) shall be read as a reference to section 15H(6). Notification of an alleged serious infringement Notification of an alleged serious infringement 15H. (1) Where an official detects an alleged serious infringement 15H.  (a) involving an Irish sea-fishing boat, wherever the boat may be, or (b) involving a foreign sea-fishing boat, in the exclusive fishery limits of the State (within the meaning of Part 3), of which boat the person who is alleged to be the master (the alleged master) is an Irish citizen or a national of another Member State, the official shall prepare a report and forward the report and any material collected in relation to the alleged infringement to the Authority.   (2) Where a report is forwarded to the Authority pursuant to subsection (1), the Authority shall   (a) send the report and any material collected relating to the alleged serious infringement to the Determination Panel to determine if a serious infringement has occurred, (b) notify the alleged master in writing  (i) that an alleged serious infringement has been detected, (ii) that he or she is alleged to have been the master of the sea‑fishing boat when the alleged serious infringement took place, (iii) that the matter shall be sent to the Determination Panel to determine if a serious infringement has occurred, (iv) of the opportunity for him or her to make submissions in writing to the Determination Panel within 30 working days from the date of the notification, and (v) that he or she may, within 30 working days from the date of the notification, make a request in writing to the Determination Panel for an oral hearing, and (c) provide the alleged master with a copy of the report and the material referred to in paragraph (a). (3) A report and any material forwarded to the Authority by an official pursuant to subsection (1) and any submission referred to in subsection (4) may be used by the Determination Panel in making a determination under subsection (6). (4) The alleged master shall be given the opportunity to make submissions in writing to the Determination Panel within 30 working days from the date of the notification referred to in subsection (2)(b). (5) The Determination Panel may request that extra information be provided by the Authority or the alleged master in relation to the issue under determination by the Determination Panel and the Authority or the alleged master, as the case may be, shall provide the information not later than 20 working days after receiving the request. (6) The Determination Panel shall, not later than 70 working days after the date of notification referred to in subsection (2)(b) to the alleged master, determine on the balance of probabilities whether a serious infringement has occurred and whether the alleged master was, at the time the serious infringement occurred, the master of the sea-fishing boat. (7) In determining whether an alleged serious infringement has occurred, the Determination Panel shall have regard to the criteria referred to in Article 3(2) of the IUU Regulation. (8) The Determination Panel shall notify the Authority and the alleged master concerned in writing of its determination under subsection (6) and the reasons for that determination. Assignment of points by Authority Assignment of points by Authority 15I. (1) Where the Authority is notified under section 15H(8) that the Determination Panel has determined that a serious infringement has occurred and the master, at the time the serious infringement occurred, was the master of the sea-fishing boat, the Authority shall 15I.  (a) in a case where the master concerned is an Irish citizen, notify the master in writing  (i) of it having been so notified, and (ii) of the proposal to assign the appropriate points in accordance with Annex XXX to the Commission Regulation or section 15U, as the case may be, to the master for the serious infringement, or (b) in a case where the master concerned is a national of another Member State, notify the master  (i) of it having been so notified, and (ii) that it is proposed to notify the competent authority of the Member State of which the master is a national of the detection of the serious infringement. (2) A notification under subsection (1) to a master shall  (a) give particulars of  (i) the serious infringement concerned, and (ii) where relevant, the appropriate number of points proposed to be assigned, and (b) inform the master of the masters right to appeal in accordance with section 15N.  (3) Subject to subsection (5), where a notification has been issued under subsection (1) in respect of a master who is an Irish citizen, the Authority shall  (a) assign the appropriate number of points to the master in question, and (b) as soon as practicable thereafter, notify the Minister of the following matters: (i) the name and address of the master to whom the points are assigned; (ii) the registration number of the registered master; (iii) the>\n(iv) the particulars of the serious infringement concerned;\n(v) the number of points assigned;\n(vi) the date from which the points are assigned.\n(4) Subject to subsection (5), where a notification has been issued under subsection (1) in respect of a master who is a national of another Member State, the Authority shall notify the competent authority of the Member State of the following matters:\n(a) the>\n(b) the name and address of, and any other>\n(c) the particulars of the serious infringement concerned;\n(d) the number of points applicable to that infringement.\n(5) Points shall not be assigned under subsection (3) or a notification shall not be made under subsection (4), as the case may be, until\n(a) the period allowed to appeal the determination by the Determination Panel to the Appeals Officer under section 15N has expired, without such an appeal having been made, or\n(b) where an appeal under section 15N is made\n(i) in case the appeal is withdrawn, the date of the withdrawal, or\n(ii) in case the Appeals Officer decides to uphold the determination of the Determination Panel in respect of the serious infringement, the date of that decision.\n(6) Where the Authority receives a notification under Article 89(4) of the Control Regulation from the competent authority of another Member State of the detection of a serious infringement involving a sea-fishing boat of which an Irish citizen was the master, the Authority shall\n(a) assign the appropriate number of points to the master, and\n(b) notify the master and the Minister accordingly.\n(7) Points assigned by the Authority in accordance with this section shall apply from the date of detection of the serious infringement concerned.\n(8) The Authority shall not assign more than 12 points in respect of any one inspection.\n(9) In this section\nidentity, in relation to a sea-fishing boat, includes the lettering and numbering of the boat;\ninspection has the same meaning as it has in Article 4(4) of the Control Regulation.\nMatters relating to points assigned\n15J. (1) Subject to subsection (2), points assigned by the Authority to a master who is an Irish citizen remain assigned regardless of any criminal proceedings pending, or the outcome of any such proceedings, in respect of the serious infringement concerned.\n(2) If a master who is an Irish citizen and to whom points have been assigned in accordance with this Chapter, does not commit, within 3 years from the date of the detection of the last serious infringement to which the points relate, another serious infringement, all points in the Irish Fishing Master Register assigned to the master concerned shall be removed and shall be deleted from the Irish Fishing Master Register.\nSuspension of Irish fishing master from Irish Fishing Master Register\n15K. (1) Subject to subsection (6) and section 15J(2), where points are assigned to a master on the Irish Fishing Master Register in accordance with this Chapter, the Minister shall suspend the registration of the master in the Irish Fishing Master Register\n(a) where the master accumulates a total of 18 points, for a period of 2 months,\n(b) where the master accumulates a total of 36 points, for a period of 4 months,\n(c) where the master accumulates a total of 54 points, for a period of 8 months, and\n(d) where the master accumulates a total of 72 points, for a period of 12 months.\n(2) Where the registration of a master in the Irish Fishing Master Register is suspended under subsection (1), the Minister shall record the suspension in that Register.\n(3) A master whose registration in the Irish Fishing Master Register has been suspended under subsection (1) shall immediately inform the holder of a sea-fishing boat licence who engages or proposes to engage him or her as master, of\n(a) such suspension,\n(b) the reasons for such suspension, and\n(c) the duration of such suspension.\n(4) A person who fails to comply with subsection (3) commits an offence and is liable on summary conviction to a class B fine.\n(5) Where during a period of suspension under subsection (1) (in this subsection referred to as the first-mentioned period), the master is assigned further points which result in a further suspension under that subsection, the period of the further suspension shall commence on the day immediately following the last day of the first-mentioned period.\n(6) Where a master whose registration in the Irish Fishing Master Register has been suspended under subsection (1) does not commit another serious infringement within 3 years from the date of the detection of the last serious infringement to which the points assigned to him or her relate, the record in that Register of the suspension shall be deleted by the Minister.\nRemoval of master from Irish Fishing Master Register for accumulation of points or suspensions\n15L. (1) Where a master accumulates 90 points (which have not been deleted in accordance with section 15J(2)) or has received five suspensions under section 15K (which have not been deleted in accordance with subsection (6) of that section), the Minister shall remove the master from the Irish Fishing Master Register.\n(2) A person who has been removed from the Irish Fishing Master Register under subsection (1) shall not be entitled to be re-entered in the Register.\n(3) A person who has been removed from the Irish Fishing Master Register under subsection (1) shall immediately inform the holder of a sea-fishing boat licence who engages or proposes to engage him or her as a master of such removal.\n(4) A person who fails to comply with subsection (3) commits an offence and shall be liable on summary conviction to a class B fine.\nAppeals Officer\n15M. (1) An Appeals Officer appointed under and in accordance with Regulation 11 of the Regulations of 2020 shall be an Appeals Officer for the purposes of this Chapter.\n(2) Paragraphs (2), (3), (5), (6) and (7) of Regulation 11 of the Regulations of 2020 shall apply to an Appeals Officer, subject to the following modifications:\n(a) a reference to the Regulations of 2020 shall be construed as a reference to this Chapter;\n(b) a reference to licence holder shall be construed as a reference to the master of a sea-fishing boat;\n(c) a reference to an appeal shall be construed as a reference to an appeal under this Chapter;\n(d) in paragraph (5), the reference to Regulation 12(11) shall be construed as a reference to section 15N(11).\n(3) Should the post of Appeals Officer become vacant, pending the appointment of a new appointee the Authority will suspend\n(a) in a case where the master concerned is an Irish citizen\n(i) the proposal to assign the appropriate points to the master for the serious infringement, and\n(ii) the notification to the master of the proposal to assign points,\nor\n(b) in a case where the master is a national of another Member State\n(i) the notification to the master of the sea-fishing boat concerned of the proposal to notify the competent authority of the Member State of which the master is a national of the detection of the serious infringement, and\n(ii) the proposal to notify the competent authority of the Member State of which the master is a national of the serious infringement detected and the number of points appropriate to that infringement.\nAppeal to the Appeals Officer\n15N. (1) A master who is\n(a) an Irish citizen to whom points are proposed to be assigned in accordance with section 15I(3), or\n(b) a national of another Member State, in respect of whom it is proposed to make a notification under section 15I(4),\nmay appeal to the Appeals Officer, not later than 30 working days from the date of the notification referred to in section 15I(1) in respect of the proposal\n(i) to assign points to him or her, or\n(ii) to notify the competent authority of the Member State of which he or she is a national,\nas the case may be.\n(2) An appeal shall\n(a) be made by the master,\n(b) be made in writing, and\n(c) be accompanied by a statement of grounds relied on by the master concerned.\n(3) The Appeals Officer shall, if so requested by a master who has made an appeal, hold an oral hearing for the purposes of the appeal.\n(4) A request by a party for any oral hearing shall be made in writing to the Appeals Officer not later than 30 working days from the date of the notification of the proposal by the Authority under section 15I(1)\n(a) to assign points to him or her, or\n(b) to notify the Member State of which the master concerned is a national.\n(5) An oral hearing shall not be held if the request referred to in subsection (4) is received later than the time specified in that subsection.\n(6) The Appeals Officer may request that extra information with regard to the subject matter of the appeal be provided by the Authority or a master and, in any case, not later than 20 working days after receiving the request, the Authority or master, as the case may be, shall provide the information.\n(7) The Appeals Officer shall arrange his or her business as he or she sees fit and may set down the procedures to be followed in respect of the conduct and consideration of appeals.\n(8) The Authority shall provide all reasonable facilities and services as may be required by the Appeals Officer for the performance of his or her functions.\n(9) The Appeals Officer may, where an appeal is made by a master\n(a) confirm that points shall be assigned to the master concerned or that notification be made to the Member State of which the master concerned is a national, as the case may be, or\n(b) find in favour of the master, in which event\n(i) in the case of a master who is an Irish citizen, points shall not be assigned and a notification shall not be made under section 15I(3), or\n(ii) in the case of a master that is a national of another Member State, a notification under section 15I(4) shall not be made.\n(10) The Appeals Officer shall confirm that points shall be assigned to the master or that notification be made to the Member State of which the master concerned is a national, as the case may be, under subsection (9)(a) where on the balance of probabilities, the Appeals Officer considers that the alleged serious infringement in respect of which it is proposed to assign points or notify the competent authority of the Member State\n(a) did occur,\n(b) involved a serious infringement, and\n(c) did involve the sea-fishing boat of which the master concerned was master at the time of the serious infringement.\n(11) Subject to subsection (12), an Appeals Officer shall make a decision in relation to an appeal not later than 45 working days from the date of receipt of the appeal by him or her under subsection (1).\n(12) In exceptional circumstances, the Appeals Officer may take not more than 15 working days in addition to the number of days mentioned in subsection (11) to make a decision.\n(13) The Appeals Officer shall notify the master concerned, and the Authority, in writing of his or her decision and the reasons for it and the decision or reasons for the decision may be published on a website maintained by the Authority.\n(14) The Authority or the master concerned may apply to the High Court on a point of law regarding a decision of the Appeals Officer.\n(15) An application to the High Court under subsection (14) shall be made not later than 28 days after the notification to the parties of the decision of the Appeals Officer under subsection (13).\n(16) In this section appeal means an appeal under this section.\nNotification of assignment of points\n15O. Where points are assigned to a master on the Irish Fishing Master Register under section 15I, the Minister shall notify the master in writing\n(a) of the number of points which have been assigned,\n(b) the total number of points assigned to him or her which have not been deleted in accordance with section 15J(2),\n(c) where the master has accumulated points, such that, in accordance with section 15K, the registration of the master in the Irish Fishing Master Register is to be suspended, the start date and end date of the period of suspension, and\n(d) where the master has accumulated sufficient points or suspensions, such that, in accordance with section 15L, the master is to be removed from the Irish Fishing Master Register, that the master has been so removed.\nService of notifications to masters\n15P. (1) Subject to subsection (2), a notification that is required to be made or a document or other material that is required to be sent to a master under this Chapter shall be addressed to the master by name, and may be made or sent in any of the following ways:\n(a) by giving a copy to the master,\n(b) by leaving it\n(i) at the address at which the master ordinarily resides or, in a case in which an address for service has been furnished, at that address, or\n(ii) on the sea-fishing boat of which the master is for the time being the master,\n(c) by sending it by post in a prepaid registered letter to the address at which the master ordinarily resides or, in a case in which an address has been furnished, to that address,\n(d) in a case in which an email address has been furnished, by sending it to that email address,\n(e) in a case in which a master is registered on an electronic interface, by leaving it on that electronic interface,\n(f) where the master is mastering a sea-fishing boat that is at sea at the time of such making or sending, by email, satellite telephone or through the fisheries monitoring centre and by subsequent confirmation by any of the other methods referred to in this subsection, or\n(g) where the master is a national of another Member State, by a request to the other Member State for notification to that master in accordance with Article 161 of the Commission Regulation.\n(2) Where a notification is required to be made, or a document or other material is required to be sent, under this Chapter to a master who is a national of another Member State and the Authority does not have contact details for him or her, the notification may be made, or the document or other material may be sent, to the licence holder of the sea-fishing boat concerned in one of the following ways:\n(a) by giving a copy of the notification, or document or other material, to the licence holder,\n(b) by leaving it\n(i) at the address at which the licence holder ordinarily resides, or in a case in which an address for service has been furnished, at that address, or\n(ii) on the sea-fishing boat for which the licence holder holds the licence,\n(c) by sending it by post in a prepaid registered letter to the address at which the licence holder ordinarily resides, or in a case in which an address has been furnished, to that address, or\n(d) in a case in which an email address has been furnished, by sending it to that email address.\n(3) For the purpose of this section, a company within the meaning of the Companies Act 2014 shall be deemed to be ordinarily resident at its registered office, and every other body corporate and every unincorporated body of persons shall be deemed to be ordinarily resident at its principal office or place of business.\n(4) In this section, electronic interface means a secure information technology platform, portal, exchange network or other similar interface maintained by, or on behalf of, the Minister which requires personal log-in details.\nMatters relating to oral hearings\n15Q. (1) In conducting an oral hearing referred to in section 15H(2)(b)(v) or section 15N(3), the Determination Panel or Appeals Officer, as the case may be, may\n(a) by notice in writing to any person, require the person to attend at such time and place as is specified in the notice to give evidence in relation to any matter in question at the hearing or to produce any books, accounts, maps, plans or other documents in his or her possession, custody or control which relate to the matter, or\n(b) take evidence on oath and for that purpose may administer oaths, and a person giving evidence at an oral hearing shall be entitled to the same immunities and privileges as if he or she were a witness before the High Court.\n(2) Where a person requests an oral hearing under section 15H(2)(b)(v) or section 15N(3), and that person fails to attend at the scheduled hearing in accordance with a notice referred to in subsection (1)(a), the Determination Panel or the Appeals Officer, as the case may be, may make the determination or finding within the time specified in sections 15H(6) or 15N(11) notwithstanding a persons failure to attend at a scheduled hearing.\n(3) A person to whom a notice referred to in subsection (1)(a) has been given who\n(a) refuses or neglects to attend in accordance with the notice,\n(b) alters, suppresses, conceals or destroys any document to which the notice relates, or\n(c) having attended in accordance with the notice, refuses to give evidence or refuses or fails to produce any document to which the notice relates,\ncommits an offence and is liable on summary conviction to a class C fine.\nOffence of employing person who is suspended or removed from Irish Fishing Master Register\n15R. (1) A holder of a sea-fishing boat licence shall not\n(a) permit a person to take control of the sea-fishing boat to which the licence relates, or\n(b) engage a person as a master of the sea-fishing boat to which the licence relates,\nknowing that the person is an Irish citizen and is not registered in the Irish Fishing Master Register or that the registration of that person in that Register is suspended under section 15K.\n(2) A holder of a sea-fishing boat licence shall not\n(a) permit a national of another Member State to take control of the sea-fishing boat to which the licence relates, or\n(b) engage such a national as a master of such a sea-fishing boat to which the licence relates,\nknowing that he or she has been suspended or removed from a register in the Member State equivalent to the Irish Fishing Master Register or has had his or her right or permission to master a sea-fishing boat permanently withdrawn under the law of that Member State that gives effect to Article 92 of the Control Regulation.\n(3) A person who contravenes subsection (1) or (2) commits an offence and is liable\n(a) on summary conviction, to a class A fine, or\n(b) on conviction on indictment, to a fine not exceeding 15,000.\n(4) In proceedings against the holder of a sea-fishing boat licence for a contravention of subsection (1)(a) or (2)(a), it shall be a defence for the defendant to prove that he or she permitted the person referred to in those paragraphs to take charge of the sea-fishing boat concerned in order to avert, or to seek to avert, an immediate or imminent danger to the sea-fishing boat or a person thereon.\nConsideration by Determination Panel and Appeals Officer of submissions\n15S. (1) A Determination Panel, in relation to an alleged serious infringement, may conduct a determination under this Chapter at the same time as conducting a determination in relation to the same serious infringement under the Regulations of 2020 acting as a Determination Panel under those Regulations and may, including during an oral hearing under section 15H(2)(b)(v) or under those Regulations, take evidence and hear and consider submissions relating to\n(a) a master in respect of whom the alleged serious infringement has been detected under this Act, and\n(b) a holder of a sea-fishing boat licence in respect of whom the alleged serious infringement has been detected under the Regulations of 2020.\n(2) An Appeals Officer, in relation to an alleged serious infringement, may conduct an appeal under this Chapter at the same time as conducting an appeal in relation to the same serious infringement under the Regulations of 2020 acting as an Appeals Officer under those Regulations and may, including during an oral hearing under section 15N(3) or under those Regulations, take evidence and hear and consider submissions relating to\n(a) a master in respect of whom the alleged serious infringement has been detected under this Act, and\n(b) a holder of a sea-fishing boat licence in respect of whom the alleged serious infringement has been detected under the Regulations of 2020.\nExtension of time limits\n15T. (1) Any time limit referred to in this Chapter within which any action is required to be taken or may not be taken, or anything is required to be done or may not be done, may be extended by the Determination Panel or the Appeals Officer, as the case may be, by such period as is necessary to align the time limit concerned with a corresponding time limit in the Regulations of 2020 relating to a determination or appeal under those Regulations arising out of the same alleged serious infringement.\n(2) Any time limit referred to in the Regulations of 2020 within which any action is required to be taken or may not be taken, or anything is required to be done or may not be done, may be extended by the Determination Panel or the Appeals Officer, as the case may be, within the meaning of those Regulations, by such period as is necessary to align the time limit concerned with a corresponding time limit in this Chapter relating to a determination or appeal under this Chapter arising out of the same alleged serious infringement.\nPoints to be assigned for serious infringement specified in Article 90(1)(c) of Control Regulation\n15U. For the purposes of Article 90 of the Control Regulation, the number of points to be assigned in accordance with this Chapter for a serious infringement specified in paragraph (1)(c) of that Article shall be five..\n\n\n7.\n\nAmendment of section 16 of Act of 2006\n\n7. Section 16 of the Act of 2006 is amended in subsection (1)(c), by the insertion of or serving in the fisheries monitoring centre, after the State,.\n\n\n8.\n\nAmendment of section 17 of Act of 2006\n\n8. Section 17 of the Act of 2006 is amended in subsection (1)(j)(i), by the substitution of paragraph (b)(i), (ii) or (v), for paragraph (b)(i) and (ii) and (v),.\n\n\n9.\n\nData Transfer\n\n9. Chapter 3 of Part 2 of the Act of 2006 is amended by the insertion of the following section after section 26:\nData Transfer\n26A. (1) (a) Information held by the Authority for the purposes of the Fisheries Acts 1959 to 2022 may be transferred by the Authority to the Revenue Commissioners.\n(b) Information held by the Revenue Commissioners for the purposes of a relevant Act relating to income derived from the fisheries sector may be transferred by the Revenue Commissioners to the Authority.\n(2) In this section, relevant Act means\n(a) an Act that is a Tax Act within the meaning of section 1(2) of the Taxes Consolidation Act 1997, or\n(b) the Value-Added Tax Consolidation Act 2010..\n\n\n10.\n\nAmendment of section 28 of Act of 2006\n\n10. Section 28 of the Act of 2006 is amended\n(a) in subsection (5), by the substitution of the following paragraph for paragraph (b):\n(b) in the case of a conviction under any other provision mentioned in a Table, any fish and fishing gear found on the boat to which the offence relates or found in any other place to which they had been moved from the boat are, as a statutory consequence of the conviction, forfeited.,\n(b) in subsection (6)(b), by the deletion of all or any of,\n(c) in column (2) of Table 1, opposite Reference Number 1(b), by the substitution of a contravention relating to fishing gear or equipment for illegal nets or other equipment,\n(d) in column (2) of Table 1, opposite Reference Number 2, by the substitution of 10(4) for 10(2), and\n(e) in column (2) of Table 2, opposite Reference Number 1, by the substitution of Section 4(13) (fishing without or in contravention of a sea-fishing boat licence). for Section 4(12) (fishing without or in contravention of sea-fishing boat licence)..\n\n\n11.\n\nAmendment of section 37 of Act of 2006\n\n11. Section 37 of the Act of 2006 is amended in paragraph (b), by the substitution of any fishing gear or for any nets or.\n\n\n12.\n\nAmendment of section 54 of Act of 2006\n\n12. Section 54 of the Act of 2006 is amended in paragraph (b), by the substitution of 51(2), for 51(2)(a),.\n\n\n13.\n\nAmendment of Fisheries (Amendment) Act 2003\n\n13. The Fisheries (Amendment) Act 2003 is amended\n(a) in section 4(3)(b) (amended by section 97 of the Act of 2006)\n(i) in subparagraph (iii), by the substitution of application is made, for application is made., and\n(ii) by the insertion of the following subparagraph after subparagraph (iii):\n(iv) where the applicant is a natural person, made by a person who is over 18 years of age at the date of the application.,\nand\n(b) in section 5 (amended by section 99(c) of the Act of 2006)\n(i) in subsection (1)(b), by the deletion of of the 2003 Act, and\n(ii) in subsection (2)(b), by the deletion of of the 2003 Act.\n\n\n14.\n\nAmendment of European Union (Common Fisheries Policy) (Point System) Regulations 2020\n\n14. Regulation 7 of the European Union (Common Fisheries Policy) (Point System) Regulations 2020 (S.I. No. 318 of 2020) is amended\n(a) by the insertion of the following paragraph after paragraph (2):\n(2A) Subject to paragraph (3), where a notification has been issued under paragraph (1) in respect of an Irish sea-fishing boat, the Authority shall assign the appropriate number of points to the holder of the Irish licence relating to the boat concerned for the serious infringement.,\n(b) in paragraph (3), by the substitution of in accordance with paragraph (2A) for in accordance with paragraph (1), and\n(c) in paragraph (4)(b)\n(i) in clause (i), by the substitution of the points are to be assigned for the proposed points are to be assigned, and\n(ii) in clause (iv), by the substitution of the number of points assigned for the number of points to be assigned.\n\n\n15.\n\nShort title, collective citation and commencement\n\n15. (1) This Act may be cited as the Sea-Fisheries (Miscellaneous Provisions) Act 2022.\n(2) The Sea-Fisheries Acts 2003 to 2019 and sections  1 to  13 may be cited together as the Sea-Fisheries Acts 2003 to 2022.\n(3) The Fisheries Acts 1959 to 2019 and sections  1 to  13 may be cited together as the Fisheries Acts 1959 to 2022.\n(4) This Act shall come into operation on such day or days as the Minister for Agriculture, Food and the Marine may by order or orders appoint either generally or with reference to any particular purpose or provision and different days may be so appointed for different purposes or different provisions.\n\n\n (iv) the particulars of the serious infringement concerned; (v) the number of points assigned; (vi) the date from which the points are assigned. (4) Subject to subsection (5), where a notification has been issued under subsection (1) in respect of a master who is a national of another Member State, the Authority shall notify the competent authority of the Member State of the following matters: (a) the>\n(b) the name and address of, and any other>\n(c) the particulars of the serious infringement concerned;\n(d) the number of points applicable to that infringement.\n(5) Points shall not be assigned under subsection (3) or a notification shall not be made under subsection (4), as the case may be, until\n(a) the period allowed to appeal the determination by the Determination Panel to the Appeals Officer under section 15N has expired, without such an appeal having been made, or\n(b) where an appeal under section 15N is made\n(i) in case the appeal is withdrawn, the date of the withdrawal, or\n(ii) in case the Appeals Officer decides to uphold the determination of the Determination Panel in respect of the serious infringement, the date of that decision.\n(6) Where the Authority receives a notification under Article 89(4) of the Control Regulation from the competent authority of another Member State of the detection of a serious infringement involving a sea-fishing boat of which an Irish citizen was the master, the Authority shall\n(a) assign the appropriate number of points to the master, and\n(b) notify the master and the Minister accordingly.\n(7) Points assigned by the Authority in accordance with this section shall apply from the date of detection of the serious infringement concerned.\n(8) The Authority shall not assign more than 12 points in respect of any one inspection.\n(9) In this section\nidentity, in relation to a sea-fishing boat, includes the lettering and numbering of the boat;\ninspection has the same meaning as it has in Article 4(4) of the Control Regulation.\nMatters relating to points assigned\n15J. (1) Subject to subsection (2), points assigned by the Authority to a master who is an Irish citizen remain assigned regardless of any criminal proceedings pending, or the outcome of any such proceedings, in respect of the serious infringement concerned.\n(2) If a master who is an Irish citizen and to whom points have been assigned in accordance with this Chapter, does not commit, within 3 years from the date of the detection of the last serious infringement to which the points relate, another serious infringement, all points in the Irish Fishing Master Register assigned to the master concerned shall be removed and shall be deleted from the Irish Fishing Master Register.\nSuspension of Irish fishing master from Irish Fishing Master Register\n15K. (1) Subject to subsection (6) and section 15J(2), where points are assigned to a master on the Irish Fishing Master Register in accordance with this Chapter, the Minister shall suspend the registration of the master in the Irish Fishing Master Register\n(a) where the master accumulates a total of 18 points, for a period of 2 months,\n(b) where the master accumulates a total of 36 points, for a period of 4 months,\n(c) where the master accumulates a total of 54 points, for a period of 8 months, and\n(d) where the master accumulates a total of 72 points, for a period of 12 months.\n(2) Where the registration of a master in the Irish Fishing Master Register is suspended under subsection (1), the Minister shall record the suspension in that Register.\n(3) A master whose registration in the Irish Fishing Master Register has been suspended under subsection (1) shall immediately inform the holder of a sea-fishing boat licence who engages or proposes to engage him or her as master, of\n(a) such suspension,\n(b) the reasons for such suspension, and\n(c) the duration of such suspension.\n(4) A person who fails to comply with subsection (3) commits an offence and is liable on summary conviction to a class B fine.\n(5) Where during a period of suspension under subsection (1) (in this subsection referred to as the first-mentioned period), the master is assigned further points which result in a further suspension under that subsection, the period of the further suspension shall commence on the day immediately following the last day of the first-mentioned period.\n(6) Where a master whose registration in the Irish Fishing Master Register has been suspended under subsection (1) does not commit another serious infringement within 3 years from the date of the detection of the last serious infringement to which the points assigned to him or her relate, the record in that Register of the suspension shall be deleted by the Minister.\nRemoval of master from Irish Fishing Master Register for accumulation of points or suspensions\n15L. (1) Where a master accumulates 90 points (which have not been deleted in accordance with section 15J(2)) or has received five suspensions under section 15K (which have not been deleted in accordance with subsection (6) of that section), the Minister shall remove the master from the Irish Fishing Master Register.\n(2) A person who has been removed from the Irish Fishing Master Register under subsection (1) shall not be entitled to be re-entered in the Register.\n(3) A person who has been removed from the Irish Fishing Master Register under subsection (1) shall immediately inform the holder of a sea-fishing boat licence who engages or proposes to engage him or her as a master of such removal.\n(4) A person who fails to comply with subsection (3) commits an offence and shall be liable on summary conviction to a class B fine.\nAppeals Officer\n15M. (1) An Appeals Officer appointed under and in accordance with Regulation 11 of the Regulations of 2020 shall be an Appeals Officer for the purposes of this Chapter.\n(2) Paragraphs (2), (3), (5), (6) and (7) of Regulation 11 of the Regulations of 2020 shall apply to an Appeals Officer, subject to the following modifications:\n(a) a reference to the Regulations of 2020 shall be construed as a reference to this Chapter;\n(b) a reference to licence holder shall be construed as a reference to the master of a sea-fishing boat;\n(c) a reference to an appeal shall be construed as a reference to an appeal under this Chapter;\n(d) in paragraph (5), the reference to Regulation 12(11) shall be construed as a reference to section 15N(11).\n(3) Should the post of Appeals Officer become vacant, pending the appointment of a new appointee the Authority will suspend\n(a) in a case where the master concerned is an Irish citizen\n(i) the proposal to assign the appropriate points to the master for the serious infringement, and\n(ii) the notification to the master of the proposal to assign points,\nor\n(b) in a case where the master is a national of another Member State\n(i) the notification to the master of the sea-fishing boat concerned of the proposal to notify the competent authority of the Member State of which the master is a national of the detection of the serious infringement, and\n(ii) the proposal to notify the competent authority of the Member State of which the master is a national of the serious infringement detected and the number of points appropriate to that infringement.\nAppeal to the Appeals Officer\n15N. (1) A master who is\n(a) an Irish citizen to whom points are proposed to be assigned in accordance with section 15I(3), or\n(b) a national of another Member State, in respect of whom it is proposed to make a notification under section 15I(4),\nmay appeal to the Appeals Officer, not later than 30 working days from the date of the notification referred to in section 15I(1) in respect of the proposal\n(i) to assign points to him or her, or\n(ii) to notify the competent authority of the Member State of which he or she is a national,\nas the case may be.\n(2) An appeal shall\n(a) be made by the master,\n(b) be made in writing, and\n(c) be accompanied by a statement of grounds relied on by the master concerned.\n(3) The Appeals Officer shall, if so requested by a master who has made an appeal, hold an oral hearing for the purposes of the appeal.\n(4) A request by a party for any oral hearing shall be made in writing to the Appeals Officer not later than 30 working days from the date of the notification of the proposal by the Authority under section 15I(1)\n(a) to assign points to him or her, or\n(b) to notify the Member State of which the master concerned is a national.\n(5) An oral hearing shall not be held if the request referred to in subsection (4) is received later than the time specified in that subsection.\n(6) The Appeals Officer may request that extra information with regard to the subject matter of the appeal be provided by the Authority or a master and, in any case, not later than 20 working days after receiving the request, the Authority or master, as the case may be, shall provide the information.\n(7) The Appeals Officer shall arrange his or her business as he or she sees fit and may set down the procedures to be followed in respect of the conduct and consideration of appeals.\n(8) The Authority shall provide all reasonable facilities and services as may be required by the Appeals Officer for the performance of his or her functions.\n(9) The Appeals Officer may, where an appeal is made by a master\n(a) confirm that points shall be assigned to the master concerned or that notification be made to the Member State of which the master concerned is a national, as the case may be, or\n(b) find in favour of the master, in which event\n(i) in the case of a master who is an Irish citizen, points shall not be assigned and a notification shall not be made under section 15I(3), or\n(ii) in the case of a master that is a national of another Member State, a notification under section 15I(4) shall not be made.\n(10) The Appeals Officer shall confirm that points shall be assigned to the master or that notification be made to the Member State of which the master concerned is a national, as the case may be, under subsection (9)(a) where on the balance of probabilities, the Appeals Officer considers that the alleged serious infringement in respect of which it is proposed to assign points or notify the competent authority of the Member State\n(a) did occur,\n(b) involved a serious infringement, and\n(c) did involve the sea-fishing boat of which the master concerned was master at the time of the serious infringement.\n(11) Subject to subsection (12), an Appeals Officer shall make a decision in relation to an appeal not later than 45 working days from the date of receipt of the appeal by him or her under subsection (1).\n(12) In exceptional circumstances, the Appeals Officer may take not more than 15 working days in addition to the number of days mentioned in subsection (11) to make a decision.\n(13) The Appeals Officer shall notify the master concerned, and the Authority, in writing of his or her decision and the reasons for it and the decision or reasons for the decision may be published on a website maintained by the Authority.\n(14) The Authority or the master concerned may apply to the High Court on a point of law regarding a decision of the Appeals Officer.\n(15) An application to the High Court under subsection (14) shall be made not later than 28 days after the notification to the parties of the decision of the Appeals Officer under subsection (13).\n(16) In this section appeal means an appeal under this section.\nNotification of assignment of points\n15O. Where points are assigned to a master on the Irish Fishing Master Register under section 15I, the Minister shall notify the master in writing\n(a) of the number of points which have been assigned,\n(b) the total number of points assigned to him or her which have not been deleted in accordance with section 15J(2),\n(c) where the master has accumulated points, such that, in accordance with section 15K, the registration of the master in the Irish Fishing Master Register is to be suspended, the start date and end date of the period of suspension, and\n(d) where the master has accumulated sufficient points or suspensions, such that, in accordance with section 15L, the master is to be removed from the Irish Fishing Master Register, that the master has been so removed.\nService of notifications to masters\n15P. (1) Subject to subsection (2), a notification that is required to be made or a document or other material that is required to be sent to a master under this Chapter shall be addressed to the master by name, and may be made or sent in any of the following ways:\n(a) by giving a copy to the master,\n(b) by leaving it\n(i) at the address at which the master ordinarily resides or, in a case in which an address for service has been furnished, at that address, or\n(ii) on the sea-fishing boat of which the master is for the time being the master,\n(c) by sending it by post in a prepaid registered letter to the address at which the master ordinarily resides or, in a case in which an address has been furnished, to that address,\n(d) in a case in which an email address has been furnished, by sending it to that email address,\n(e) in a case in which a master is registered on an electronic interface, by leaving it on that electronic interface,\n(f) where the master is mastering a sea-fishing boat that is at sea at the time of such making or sending, by email, satellite telephone or through the fisheries monitoring centre and by subsequent confirmation by any of the other methods referred to in this subsection, or\n(g) where the master is a national of another Member State, by a request to the other Member State for notification to that master in accordance with Article 161 of the Commission Regulation.\n(2) Where a notification is required to be made, or a document or other material is required to be sent, under this Chapter to a master who is a national of another Member State and the Authority does not have contact details for him or her, the notification may be made, or the document or other material may be sent, to the licence holder of the sea-fishing boat concerned in one of the following ways:\n(a) by giving a copy of the notification, or document or other material, to the licence holder,\n(b) by leaving it\n(i) at the address at which the licence holder ordinarily resides, or in a case in which an address for service has been furnished, at that address, or\n(ii) on the sea-fishing boat for which the licence holder holds the licence,\n(c) by sending it by post in a prepaid registered letter to the address at which the licence holder ordinarily resides, or in a case in which an address has been furnished, to that address, or\n(d) in a case in which an email address has been furnished, by sending it to that email address.\n(3) For the purpose of this section, a company within the meaning of the Companies Act 2014 shall be deemed to be ordinarily resident at its registered office, and every other body corporate and every unincorporated body of persons shall be deemed to be ordinarily resident at its principal office or place of business.\n(4) In this section, electronic interface means a secure information technology platform, portal, exchange network or other similar interface maintained by, or on behalf of, the Minister which requires personal log-in details.\nMatters relating to oral hearings\n15Q. (1) In conducting an oral hearing referred to in section 15H(2)(b)(v) or section 15N(3), the Determination Panel or Appeals Officer, as the case may be, may\n(a) by notice in writing to any person, require the person to attend at such time and place as is specified in the notice to give evidence in relation to any matter in question at the hearing or to produce any books, accounts, maps, plans or other documents in his or her possession, custody or control which relate to the matter, or\n(b) take evidence on oath and for that purpose may administer oaths, and a person giving evidence at an oral hearing shall be entitled to the same immunities and privileges as if he or she were a witness before the High Court.\n(2) Where a person requests an oral hearing under section 15H(2)(b)(v) or section 15N(3), and that person fails to attend at the scheduled hearing in accordance with a notice referred to in subsection (1)(a), the Determination Panel or the Appeals Officer, as the case may be, may make the determination or finding within the time specified in sections 15H(6) or 15N(11) notwithstanding a persons failure to attend at a scheduled hearing.\n(3) A person to whom a notice referred to in subsection (1)(a) has been given who\n(a) refuses or neglects to attend in accordance with the notice,\n(b) alters, suppresses, conceals or destroys any document to which the notice relates, or\n(c) having attended in accordance with the notice, refuses to give evidence or refuses or fails to produce any document to which the notice relates,\ncommits an offence and is liable on summary conviction to a class C fine.\nOffence of employing person who is suspended or removed from Irish Fishing Master Register\n15R. (1) A holder of a sea-fishing boat licence shall not\n(a) permit a person to take control of the sea-fishing boat to which the licence relates, or\n(b) engage a person as a master of the sea-fishing boat to which the licence relates,\nknowing that the person is an Irish citizen and is not registered in the Irish Fishing Master Register or that the registration of that person in that Register is suspended under section 15K.\n(2) A holder of a sea-fishing boat licence shall not\n(a) permit a national of another Member State to take control of the sea-fishing boat to which the licence relates, or\n(b) engage such a national as a master of such a sea-fishing boat to which the licence relates,\nknowing that he or she has been suspended or removed from a register in the Member State equivalent to the Irish Fishing Master Register or has had his or her right or permission to master a sea-fishing boat permanently withdrawn under the law of that Member State that gives effect to Article 92 of the Control Regulation.\n(3) A person who contravenes subsection (1) or (2) commits an offence and is liable\n(a) on summary conviction, to a class A fine, or\n(b) on conviction on indictment, to a fine not exceeding 15,000.\n(4) In proceedings against the holder of a sea-fishing boat licence for a contravention of subsection (1)(a) or (2)(a), it shall be a defence for the defendant to prove that he or she permitted the person referred to in those paragraphs to take charge of the sea-fishing boat concerned in order to avert, or to seek to avert, an immediate or imminent danger to the sea-fishing boat or a person thereon.\nConsideration by Determination Panel and Appeals Officer of submissions\n15S. (1) A Determination Panel, in relation to an alleged serious infringement, may conduct a determination under this Chapter at the same time as conducting a determination in relation to the same serious infringement under the Regulations of 2020 acting as a Determination Panel under those Regulations and may, including during an oral hearing under section 15H(2)(b)(v) or under those Regulations, take evidence and hear and consider submissions relating to\n(a) a master in respect of whom the alleged serious infringement has been detected under this Act, and\n(b) a holder of a sea-fishing boat licence in respect of whom the alleged serious infringement has been detected under the Regulations of 2020.\n(2) An Appeals Officer, in relation to an alleged serious infringement, may conduct an appeal under this Chapter at the same time as conducting an appeal in relation to the same serious infringement under the Regulations of 2020 acting as an Appeals Officer under those Regulations and may, including during an oral hearing under section 15N(3) or under those Regulations, take evidence and hear and consider submissions relating to\n(a) a master in respect of whom the alleged serious infringement has been detected under this Act, and\n(b) a holder of a sea-fishing boat licence in respect of whom the alleged serious infringement has been detected under the Regulations of 2020.\nExtension of time limits\n15T. (1) Any time limit referred to in this Chapter within which any action is required to be taken or may not be taken, or anything is required to be done or may not be done, may be extended by the Determination Panel or the Appeals Officer, as the case may be, by such period as is necessary to align the time limit concerned with a corresponding time limit in the Regulations of 2020 relating to a determination or appeal under those Regulations arising out of the same alleged serious infringement.\n(2) Any time limit referred to in the Regulations of 2020 within which any action is required to be taken or may not be taken, or anything is required to be done or may not be done, may be extended by the Determination Panel or the Appeals Officer, as the case may be, within the meaning of those Regulations, by such period as is necessary to align the time limit concerned with a corresponding time limit in this Chapter relating to a determination or appeal under this Chapter arising out of the same alleged serious infringement.\nPoints to be assigned for serious infringement specified in Article 90(1)(c) of Control Regulation\n15U. For the purposes of Article 90 of the Control Regulation, the number of points to be assigned in accordance with this Chapter for a serious infringement specified in paragraph (1)(c) of that Article shall be five..\n\n\n7.\n\nAmendment of section 16 of Act of 2006\n\n7. Section 16 of the Act of 2006 is amended in subsection (1)(c), by the insertion of or serving in the fisheries monitoring centre, after the State,.\n\n\n8.\n\nAmendment of section 17 of Act of 2006\n\n8. Section 17 of the Act of 2006 is amended in subsection (1)(j)(i), by the substitution of paragraph (b)(i), (ii) or (v), for paragraph (b)(i) and (ii) and (v),.\n\n\n9.\n\nData Transfer\n\n9. Chapter 3 of Part 2 of the Act of 2006 is amended by the insertion of the following section after section 26:\nData Transfer\n26A. (1) (a) Information held by the Authority for the purposes of the Fisheries Acts 1959 to 2022 may be transferred by the Authority to the Revenue Commissioners.\n(b) Information held by the Revenue Commissioners for the purposes of a relevant Act relating to income derived from the fisheries sector may be transferred by the Revenue Commissioners to the Authority.\n(2) In this section, relevant Act means\n(a) an Act that is a Tax Act within the meaning of section 1(2) of the Taxes Consolidation Act 1997, or\n(b) the Value-Added Tax Consolidation Act 2010..\n\n\n10.\n\nAmendment of section 28 of Act of 2006\n\n10. Section 28 of the Act of 2006 is amended\n(a) in subsection (5), by the substitution of the following paragraph for paragraph (b):\n(b) in the case of a conviction under any other provision mentioned in a Table, any fish and fishing gear found on the boat to which the offence relates or found in any other place to which they had been moved from the boat are, as a statutory consequence of the conviction, forfeited.,\n(b) in subsection (6)(b), by the deletion of all or any of,\n(c) in column (2) of Table 1, opposite Reference Number 1(b), by the substitution of a contravention relating to fishing gear or equipment for illegal nets or other equipment,\n(d) in column (2) of Table 1, opposite Reference Number 2, by the substitution of 10(4) for 10(2), and\n(e) in column (2) of Table 2, opposite Reference Number 1, by the substitution of Section 4(13) (fishing without or in contravention of a sea-fishing boat licence). for Section 4(12) (fishing without or in contravention of sea-fishing boat licence)..\n\n\n11.\n\nAmendment of section 37 of Act of 2006\n\n11. Section 37 of the Act of 2006 is amended in paragraph (b), by the substitution of any fishing gear or for any nets or.\n\n\n12.\n\nAmendment of section 54 of Act of 2006\n\n12. Section 54 of the Act of 2006 is amended in paragraph (b), by the substitution of 51(2), for 51(2)(a),.\n\n\n13.\n\nAmendment of Fisheries (Amendment) Act 2003\n\n13. The Fisheries (Amendment) Act 2003 is amended\n(a) in section 4(3)(b) (amended by section 97 of the Act of 2006)\n(i) in subparagraph (iii), by the substitution of application is made, for application is made., and\n(ii) by the insertion of the following subparagraph after subparagraph (iii):\n(iv) where the applicant is a natural person, made by a person who is over 18 years of age at the date of the application.,\nand\n(b) in section 5 (amended by section 99(c) of the Act of 2006)\n(i) in subsection (1)(b), by the deletion of of the 2003 Act, and\n(ii) in subsection (2)(b), by the deletion of of the 2003 Act.\n\n\n14.\n\nAmendment of European Union (Common Fisheries Policy) (Point System) Regulations 2020\n\n14. Regulation 7 of the European Union (Common Fisheries Policy) (Point System) Regulations 2020 (S.I. No. 318 of 2020) is amended\n(a) by the insertion of the following paragraph after paragraph (2):\n(2A) Subject to paragraph (3), where a notification has been issued under paragraph (1) in respect of an Irish sea-fishing boat, the Authority shall assign the appropriate number of points to the holder of the Irish licence relating to the boat concerned for the serious infringement.,\n(b) in paragraph (3), by the substitution of in accordance with paragraph (2A) for in accordance with paragraph (1), and\n(c) in paragraph (4)(b)\n(i) in clause (i), by the substitution of the points are to be assigned for the proposed points are to be assigned, and\n(ii) in clause (iv), by the substitution of the number of points assigned for the number of points to be assigned.\n\n\n15.\n\nShort title, collective citation and commencement\n\n15. (1) This Act may be cited as the Sea-Fisheries (Miscellaneous Provisions) Act 2022.\n(2) The Sea-Fisheries Acts 2003 to 2019 and sections  1 to  13 may be cited together as the Sea-Fisheries Acts 2003 to 2022.\n(3) The Fisheries Acts 1959 to 2019 and sections  1 to  13 may be cited together as the Fisheries Acts 1959 to 2022.\n(4) This Act shall come into operation on such day or days as the Minister for Agriculture, Food and the Marine may by order or orders appoint either generally or with reference to any particular purpose or provision and different days may be so appointed for different purposes or different provisions.\n\n (b) the name and address of, and any other>\n(c) the particulars of the serious infringement concerned;\n(d) the number of points applicable to that infringement.\n(5) Points shall not be assigned under subsection (3) or a notification shall not be made under subsection (4), as the case may be, until\n(a) the period allowed to appeal the determination by the Determination Panel to the Appeals Officer under section 15N has expired, without such an appeal having been made, or\n(b) where an appeal under section 15N is made\n(i) in case the appeal is withdrawn, the date of the withdrawal, or\n(ii) in case the Appeals Officer decides to uphold the determination of the Determination Panel in respect of the serious infringement, the date of that decision.\n(6) Where the Authority receives a notification under Article 89(4) of the Control Regulation from the competent authority of another Member State of the detection of a serious infringement involving a sea-fishing boat of which an Irish citizen was the master, the Authority shall\n(a) assign the appropriate number of points to the master, and\n(b) notify the master and the Minister accordingly.\n(7) Points assigned by the Authority in accordance with this section shall apply from the date of detection of the serious infringement concerned.\n(8) The Authority shall not assign more than 12 points in respect of any one inspection.\n(9) In this section\nidentity, in relation to a sea-fishing boat, includes the lettering and numbering of the boat;\ninspection has the same meaning as it has in Article 4(4) of the Control Regulation.\nMatters relating to points assigned\n15J. (1) Subject to subsection (2), points assigned by the Authority to a master who is an Irish citizen remain assigned regardless of any criminal proceedings pending, or the outcome of any such proceedings, in respect of the serious infringement concerned.\n(2) If a master who is an Irish citizen and to whom points have been assigned in accordance with this Chapter, does not commit, within 3 years from the date of the detection of the last serious infringement to which the points relate, another serious infringement, all points in the Irish Fishing Master Register assigned to the master concerned shall be removed and shall be deleted from the Irish Fishing Master Register.\nSuspension of Irish fishing master from Irish Fishing Master Register\n15K. (1) Subject to subsection (6) and section 15J(2), where points are assigned to a master on the Irish Fishing Master Register in accordance with this Chapter, the Minister shall suspend the registration of the master in the Irish Fishing Master Register\n(a) where the master accumulates a total of 18 points, for a period of 2 months,\n(b) where the master accumulates a total of 36 points, for a period of 4 months,\n(c) where the master accumulates a total of 54 points, for a period of 8 months, and\n(d) where the master accumulates a total of 72 points, for a period of 12 months.\n(2) Where the registration of a master in the Irish Fishing Master Register is suspended under subsection (1), the Minister shall record the suspension in that Register.\n(3) A master whose registration in the Irish Fishing Master Register has been suspended under subsection (1) shall immediately inform the holder of a sea-fishing boat licence who engages or proposes to engage him or her as master, of\n(a) such suspension,\n(b) the reasons for such suspension, and\n(c) the duration of such suspension.\n(4) A person who fails to comply with subsection (3) commits an offence and is liable on summary conviction to a class B fine.\n(5) Where during a period of suspension under subsection (1) (in this subsection referred to as the first-mentioned period), the master is assigned further points which result in a further suspension under that subsection, the period of the further suspension shall commence on the day immediately following the last day of the first-mentioned period.\n(6) Where a master whose registration in the Irish Fishing Master Register has been suspended under subsection (1) does not commit another serious infringement within 3 years from the date of the detection of the last serious infringement to which the points assigned to him or her relate, the record in that Register of the suspension shall be deleted by the Minister.\nRemoval of master from Irish Fishing Master Register for accumulation of points or suspensions\n15L. (1) Where a master accumulates 90 points (which have not been deleted in accordance with section 15J(2)) or has received five suspensions under section 15K (which have not been deleted in accordance with subsection (6) of that section), the Minister shall remove the master from the Irish Fishing Master Register.\n(2) A person who has been removed from the Irish Fishing Master Register under subsection (1) shall not be entitled to be re-entered in the Register.\n(3) A person who has been removed from the Irish Fishing Master Register under subsection (1) shall immediately inform the holder of a sea-fishing boat licence who engages or proposes to engage him or her as a master of such removal.\n(4) A person who fails to comply with subsection (3) commits an offence and shall be liable on summary conviction to a class B fine.\nAppeals Officer\n15M. (1) An Appeals Officer appointed under and in accordance with Regulation 11 of the Regulations of 2020 shall be an Appeals Officer for the purposes of this Chapter.\n(2) Paragraphs (2), (3), (5), (6) and (7) of Regulation 11 of the Regulations of 2020 shall apply to an Appeals Officer, subject to the following modifications:\n(a) a reference to the Regulations of 2020 shall be construed as a reference to this Chapter;\n(b) a reference to licence holder shall be construed as a reference to the master of a sea-fishing boat;\n(c) a reference to an appeal shall be construed as a reference to an appeal under this Chapter;\n(d) in paragraph (5), the reference to Regulation 12(11) shall be construed as a reference to section 15N(11).\n(3) Should the post of Appeals Officer become vacant, pending the appointment of a new appointee the Authority will suspend\n(a) in a case where the master concerned is an Irish citizen\n(i) the proposal to assign the appropriate points to the master for the serious infringement, and\n(ii) the notification to the master of the proposal to assign points,\nor\n(b) in a case where the master is a national of another Member State\n(i) the notification to the master of the sea-fishing boat concerned of the proposal to notify the competent authority of the Member State of which the master is a national of the detection of the serious infringement, and\n(ii) the proposal to notify the competent authority of the Member State of which the master is a national of the serious infringement detected and the number of points appropriate to that infringement.\nAppeal to the Appeals Officer\n15N. (1) A master who is\n(a) an Irish citizen to whom points are proposed to be assigned in accordance with section 15I(3), or\n(b) a national of another Member State, in respect of whom it is proposed to make a notification under section 15I(4),\nmay appeal to the Appeals Officer, not later than 30 working days from the date of the notification referred to in section 15I(1) in respect of the proposal\n(i) to assign points to him or her, or\n(ii) to notify the competent authority of the Member State of which he or she is a national,\nas the case may be.\n(2) An appeal shall\n(a) be made by the master,\n(b) be made in writing, and\n(c) be accompanied by a statement of grounds relied on by the master concerned.\n(3) The Appeals Officer shall, if so requested by a master who has made an appeal, hold an oral hearing for the purposes of the appeal.\n(4) A request by a party for any oral hearing shall be made in writing to the Appeals Officer not later than 30 working days from the date of the notification of the proposal by the Authority under section 15I(1)\n(a) to assign points to him or her, or\n(b) to notify the Member State of which the master concerned is a national.\n(5) An oral hearing shall not be held if the request referred to in subsection (4) is received later than the time specified in that subsection.\n(6) The Appeals Officer may request that extra information with regard to the subject matter of the appeal be provided by the Authority or a master and, in any case, not later than 20 working days after receiving the request, the Authority or master, as the case may be, shall provide the information.\n(7) The Appeals Officer shall arrange his or her business as he or she sees fit and may set down the procedures to be followed in respect of the conduct and consideration of appeals.\n(8) The Authority shall provide all reasonable facilities and services as may be required by the Appeals Officer for the performance of his or her functions.\n(9) The Appeals Officer may, where an appeal is made by a master\n(a) confirm that points shall be assigned to the master concerned or that notification be made to the Member State of which the master concerned is a national, as the case may be, or\n(b) find in favour of the master, in which event\n(i) in the case of a master who is an Irish citizen, points shall not be assigned and a notification shall not be made under section 15I(3), or\n(ii) in the case of a master that is a national of another Member State, a notification under section 15I(4) shall not be made.\n(10) The Appeals Officer shall confirm that points shall be assigned to the master or that notification be made to the Member State of which the master concerned is a national, as the case may be, under subsection (9)(a) where on the balance of probabilities, the Appeals Officer considers that the alleged serious infringement in respect of which it is proposed to assign points or notify the competent authority of the Member State\n(a) did occur,\n(b) involved a serious infringement, and\n(c) did involve the sea-fishing boat of which the master concerned was master at the time of the serious infringement.\n(11) Subject to subsection (12), an Appeals Officer shall make a decision in relation to an appeal not later than 45 working days from the date of receipt of the appeal by him or her under subsection (1).\n(12) In exceptional circumstances, the Appeals Officer may take not more than 15 working days in addition to the number of days mentioned in subsection (11) to make a decision.\n(13) The Appeals Officer shall notify the master concerned, and the Authority, in writing of his or her decision and the reasons for it and the decision or reasons for the decision may be published on a website maintained by the Authority.\n(14) The Authority or the master concerned may apply to the High Court on a point of law regarding a decision of the Appeals Officer.\n(15) An application to the High Court under subsection (14) shall be made not later than 28 days after the notification to the parties of the decision of the Appeals Officer under subsection (13).\n(16) In this section appeal means an appeal under this section.\nNotification of assignment of points\n15O. Where points are assigned to a master on the Irish Fishing Master Register under section 15I, the Minister shall notify the master in writing\n(a) of the number of points which have been assigned,\n(b) the total number of points assigned to him or her which have not been deleted in accordance with section 15J(2),\n(c) where the master has accumulated points, such that, in accordance with section 15K, the registration of the master in the Irish Fishing Master Register is to be suspended, the start date and end date of the period of suspension, and\n(d) where the master has accumulated sufficient points or suspensions, such that, in accordance with section 15L, the master is to be removed from the Irish Fishing Master Register, that the master has been so removed.\nService of notifications to masters\n15P. (1) Subject to subsection (2), a notification that is required to be made or a document or other material that is required to be sent to a master under this Chapter shall be addressed to the master by name, and may be made or sent in any of the following ways:\n(a) by giving a copy to the master,\n(b) by leaving it\n(i) at the address at which the master ordinarily resides or, in a case in which an address for service has been furnished, at that address, or\n(ii) on the sea-fishing boat of which the master is for the time being the master,\n(c) by sending it by post in a prepaid registered letter to the address at which the master ordinarily resides or, in a case in which an address has been furnished, to that address,\n(d) in a case in which an email address has been furnished, by sending it to that email address,\n(e) in a case in which a master is registered on an electronic interface, by leaving it on that electronic interface,\n(f) where the master is mastering a sea-fishing boat that is at sea at the time of such making or sending, by email, satellite telephone or through the fisheries monitoring centre and by subsequent confirmation by any of the other methods referred to in this subsection, or\n(g) where the master is a national of another Member State, by a request to the other Member State for notification to that master in accordance with Article 161 of the Commission Regulation.\n(2) Where a notification is required to be made, or a document or other material is required to be sent, under this Chapter to a master who is a national of another Member State and the Authority does not have contact details for him or her, the notification may be made, or the document or other material may be sent, to the licence holder of the sea-fishing boat concerned in one of the following ways:\n(a) by giving a copy of the notification, or document or other material, to the licence holder,\n(b) by leaving it\n(i) at the address at which the licence holder ordinarily resides, or in a case in which an address for service has been furnished, at that address, or\n(ii) on the sea-fishing boat for which the licence holder holds the licence,\n(c) by sending it by post in a prepaid registered letter to the address at which the licence holder ordinarily resides, or in a case in which an address has been furnished, to that address, or\n(d) in a case in which an email address has been furnished, by sending it to that email address.\n(3) For the purpose of this section, a company within the meaning of the Companies Act 2014 shall be deemed to be ordinarily resident at its registered office, and every other body corporate and every unincorporated body of persons shall be deemed to be ordinarily resident at its principal office or place of business.\n(4) In this section, electronic interface means a secure information technology platform, portal, exchange network or other similar interface maintained by, or on behalf of, the Minister which requires personal log-in details.\nMatters relating to oral hearings\n15Q. (1) In conducting an oral hearing referred to in section 15H(2)(b)(v) or section 15N(3), the Determination Panel or Appeals Officer, as the case may be, may\n(a) by notice in writing to any person, require the person to attend at such time and place as is specified in the notice to give evidence in relation to any matter in question at the hearing or to produce any books, accounts, maps, plans or other documents in his or her possession, custody or control which relate to the matter, or\n(b) take evidence on oath and for that purpose may administer oaths, and a person giving evidence at an oral hearing shall be entitled to the same immunities and privileges as if he or she were a witness before the High Court.\n(2) Where a person requests an oral hearing under section 15H(2)(b)(v) or section 15N(3), and that person fails to attend at the scheduled hearing in accordance with a notice referred to in subsection (1)(a), the Determination Panel or the Appeals Officer, as the case may be, may make the determination or finding within the time specified in sections 15H(6) or 15N(11) notwithstanding a persons failure to attend at a scheduled hearing.\n(3) A person to whom a notice referred to in subsection (1)(a) has been given who\n(a) refuses or neglects to attend in accordance with the notice,\n(b) alters, suppresses, conceals or destroys any document to which the notice relates, or\n(c) having attended in accordance with the notice, refuses to give evidence or refuses or fails to produce any document to which the notice relates,\ncommits an offence and is liable on summary conviction to a class C fine.\nOffence of employing person who is suspended or removed from Irish Fishing Master Register\n15R. (1) A holder of a sea-fishing boat licence shall not\n(a) permit a person to take control of the sea-fishing boat to which the licence relates, or\n(b) engage a person as a master of the sea-fishing boat to which the licence relates,\nknowing that the person is an Irish citizen and is not registered in the Irish Fishing Master Register or that the registration of that person in that Register is suspended under section 15K.\n(2) A holder of a sea-fishing boat licence shall not\n(a) permit a national of another Member State to take control of the sea-fishing boat to which the licence relates, or\n(b) engage such a national as a master of such a sea-fishing boat to which the licence relates,\nknowing that he or she has been suspended or removed from a register in the Member State equivalent to the Irish Fishing Master Register or has had his or her right or permission to master a sea-fishing boat permanently withdrawn under the law of that Member State that gives effect to Article 92 of the Control Regulation.\n(3) A person who contravenes subsection (1) or (2) commits an offence and is liable\n(a) on summary conviction, to a class A fine, or\n(b) on conviction on indictment, to a fine not exceeding 15,000.\n(4) In proceedings against the holder of a sea-fishing boat licence for a contravention of subsection (1)(a) or (2)(a), it shall be a defence for the defendant to prove that he or she permitted the person referred to in those paragraphs to take charge of the sea-fishing boat concerned in order to avert, or to seek to avert, an immediate or imminent danger to the sea-fishing boat or a person thereon.\nConsideration by Determination Panel and Appeals Officer of submissions\n15S. (1) A Determination Panel, in relation to an alleged serious infringement, may conduct a determination under this Chapter at the same time as conducting a determination in relation to the same serious infringement under the Regulations of 2020 acting as a Determination Panel under those Regulations and may, including during an oral hearing under section 15H(2)(b)(v) or under those Regulations, take evidence and hear and consider submissions relating to\n(a) a master in respect of whom the alleged serious infringement has been detected under this Act, and\n(b) a holder of a sea-fishing boat licence in respect of whom the alleged serious infringement has been detected under the Regulations of 2020.\n(2) An Appeals Officer, in relation to an alleged serious infringement, may conduct an appeal under this Chapter at the same time as conducting an appeal in relation to the same serious infringement under the Regulations of 2020 acting as an Appeals Officer under those Regulations and may, including during an oral hearing under section 15N(3) or under those Regulations, take evidence and hear and consider submissions relating to\n(a) a master in respect of whom the alleged serious infringement has been detected under this Act, and\n(b) a holder of a sea-fishing boat licence in respect of whom the alleged serious infringement has been detected under the Regulations of 2020.\nExtension of time limits\n15T. (1) Any time limit referred to in this Chapter within which any action is required to be taken or may not be taken, or anything is required to be done or may not be done, may be extended by the Determination Panel or the Appeals Officer, as the case may be, by such period as is necessary to align the time limit concerned with a corresponding time limit in the Regulations of 2020 relating to a determination or appeal under those Regulations arising out of the same alleged serious infringement.\n(2) Any time limit referred to in the Regulations of 2020 within which any action is required to be taken or may not be taken, or anything is required to be done or may not be done, may be extended by the Determination Panel or the Appeals Officer, as the case may be, within the meaning of those Regulations, by such period as is necessary to align the time limit concerned with a corresponding time limit in this Chapter relating to a determination or appeal under this Chapter arising out of the same alleged serious infringement.\nPoints to be assigned for serious infringement specified in Article 90(1)(c) of Control Regulation\n15U. For the purposes of Article 90 of the Control Regulation, the number of points to be assigned in accordance with this Chapter for a serious infringement specified in paragraph (1)(c) of that Article shall be five..\n (c) the particulars of the serious infringement concerned; (d) the number of points applicable to that infringement. (5) Points shall not be assigned under subsection (3) or a notification shall not be made under subsection (4), as the case may be, until  (a) the period allowed to appeal the determination by the Determination Panel to the Appeals Officer under section 15N has expired, without such an appeal having been made, or (b) where an appeal under section 15N is made  (i) in case the appeal is withdrawn, the date of the withdrawal, or (ii) in case the Appeals Officer decides to uphold the determination of the Determination Panel in respect of the serious infringement, the date of that decision. (6) Where the Authority receives a notification under Article 89(4) of the Control Regulation from the competent authority of another Member State of the detection of a serious infringement involving a sea-fishing boat of which an Irish citizen was the master, the Authority shall  (a) assign the appropriate number of points to the master, and (b) notify the master and the Minister accordingly. (7) Points assigned by the Authority in accordance with this section shall apply from the date of detection of the serious infringement concerned. (8) The Authority shall not assign more than 12 points in respect of any one inspection. (9) In this section  identity, in relation to a sea-fishing boat, includes the lettering and numbering of the boat;   inspection has the same meaning as it has in Article 4(4) of the Control Regulation.   Matters relating to points assigned Matters relating to points assigned 15J. (1) Subject to subsection (2), points assigned by the Authority to a master who is an Irish citizen remain assigned regardless of any criminal proceedings pending, or the outcome of any such proceedings, in respect of the serious infringement concerned. 15J. (2) If a master who is an Irish citizen and to whom points have been assigned in accordance with this Chapter, does not commit, within 3 years from the date of the detection of the last serious infringement to which the points relate, another serious infringement, all points in the Irish Fishing Master Register assigned to the master concerned shall be removed and shall be deleted from the Irish Fishing Master Register. Suspension of Irish fishing master from Irish Fishing Master Register Suspension of Irish fishing master from Irish Fishing Master Register 15K. (1) Subject to subsection (6) and section 15J(2), where points are assigned to a master on the Irish Fishing Master Register in accordance with this Chapter, the Minister shall suspend the registration of the master in the Irish Fishing Master Register 15K.  (a) where the master accumulates a total of 18 points, for a period of 2 months, (b) where the master accumulates a total of 36 points, for a period of 4 months, (c) where the master accumulates a total of 54 points, for a period of 8 months, and (d) where the master accumulates a total of 72 points, for a period of 12 months. (2) Where the registration of a master in the Irish Fishing Master Register is suspended under subsection (1), the Minister shall record the suspension in that Register. (3) A master whose registration in the Irish Fishing Master Register has been suspended under subsection (1) shall immediately inform the holder of a sea-fishing boat licence who engages or proposes to engage him or her as master, of  (a) such suspension, (b) the reasons for such suspension, and (c) the duration of such suspension. (4) A person who fails to comply with subsection (3) commits an offence and is liable on summary conviction to a class B fine. (5) Where during a period of suspension under subsection (1) (in this subsection referred to as the first-mentioned period), the master is assigned further points which result in a further suspension under that subsection, the period of the further suspension shall commence on the day immediately following the last day of the first-mentioned period.   (6) Where a master whose registration in the Irish Fishing Master Register has been suspended under subsection (1) does not commit another serious infringement within 3 years from the date of the detection of the last serious infringement to which the points assigned to him or her relate, the record in that Register of the suspension shall be deleted by the Minister. Removal of master from Irish Fishing Master Register for accumulation of points or suspensions Removal of master from Irish Fishing Master Register for accumulation of points or suspensions 15L. (1) Where a master accumulates 90 points (which have not been deleted in accordance with section 15J(2)) or has received five suspensions under section 15K (which have not been deleted in accordance with subsection (6) of that section), the Minister shall remove the master from the Irish Fishing Master Register. 15L. (2) A person who has been removed from the Irish Fishing Master Register under subsection (1) shall not be entitled to be re-entered in the Register. (3) A person who has been removed from the Irish Fishing Master Register under subsection (1) shall immediately inform the holder of a sea-fishing boat licence who engages or proposes to engage him or her as a master of such removal. (4) A person who fails to comply with subsection (3) commits an offence and shall be liable on summary conviction to a class B fine. Appeals Officer Appeals Officer 15M. (1) An Appeals Officer appointed under and in accordance with Regulation 11 of the Regulations of 2020 shall be an Appeals Officer for the purposes of this Chapter. 15M. (2) Paragraphs (2), (3), (5), (6) and (7) of Regulation 11 of the Regulations of 2020 shall apply to an Appeals Officer, subject to the following modifications: (a) a reference to the Regulations of 2020 shall be construed as a reference to this Chapter; (b) a reference to licence holder shall be construed as a reference to the master of a sea-fishing boat;   (c) a reference to an appeal shall be construed as a reference to an appeal under this Chapter; (d) in paragraph (5), the reference to Regulation 12(11) shall be construed as a reference to section 15N(11). (3) Should the post of Appeals Officer become vacant, pending the appointment of a new appointee the Authority will suspend  (a) in a case where the master concerned is an Irish citizen  (i) the proposal to assign the appropriate points to the master for the serious infringement, and (ii) the notification to the master of the proposal to assign points, or (b) in a case where the master is a national of another Member State  (i) the notification to the master of the sea-fishing boat concerned of the proposal to notify the competent authority of the Member State of which the master is a national of the detection of the serious infringement, and (ii) the proposal to notify the competent authority of the Member State of which the master is a national of the serious infringement detected and the number of points appropriate to that infringement. Appeal to the Appeals Officer Appeal to the Appeals Officer 15N. (1) A master who is 15N.  (a) an Irish citizen to whom points are proposed to be assigned in accordance with section 15I(3), or (b) a national of another Member State, in respect of whom it is proposed to make a notification under section 15I(4), may appeal to the Appeals Officer, not later than 30 working days from the date of the notification referred to in section 15I(1) in respect of the proposal  (i) to assign points to him or her, or (ii) to notify the competent authority of the Member State of which he or she is a national, as the case may be. (2) An appeal shall  (a) be made by the master, (b) be made in writing, and (c) be accompanied by a statement of grounds relied on by the master concerned. (3) The Appeals Officer shall, if so requested by a master who has made an appeal, hold an oral hearing for the purposes of the appeal. (4) A request by a party for any oral hearing shall be made in writing to the Appeals Officer not later than 30 working days from the date of the notification of the proposal by the Authority under section 15I(1)  (a) to assign points to him or her, or (b) to notify the Member State of which the master concerned is a national. (5) An oral hearing shall not be held if the request referred to in subsection (4) is received later than the time specified in that subsection. (6) The Appeals Officer may request that extra information with regard to the subject matter of the appeal be provided by the Authority or a master and, in any case, not later than 20 working days after receiving the request, the Authority or master, as the case may be, shall provide the information. (7) The Appeals Officer shall arrange his or her business as he or she sees fit and may set down the procedures to be followed in respect of the conduct and consideration of appeals. (8) The Authority shall provide all reasonable facilities and services as may be required by the Appeals Officer for the performance of his or her functions. (9) The Appeals Officer may, where an appeal is made by a master  (a) confirm that points shall be assigned to the master concerned or that notification be made to the Member State of which the master concerned is a national, as the case may be, or (b) find in favour of the master, in which event  (i) in the case of a master who is an Irish citizen, points shall not be assigned and a notification shall not be made under section 15I(3), or (ii) in the case of a master that is a national of another Member State, a notification under section 15I(4) shall not be made. (10) The Appeals Officer shall confirm that points shall be assigned to the master or that notification be made to the Member State of which the master concerned is a national, as the case may be, under subsection (9)(a) where on the balance of probabilities, the Appeals Officer considers that the alleged serious infringement in respect of which it is proposed to assign points or notify the competent authority of the Member State  (a) did occur, (b) involved a serious infringement, and (c) did involve the sea-fishing boat of which the master concerned was master at the time of the serious infringement. (11) Subject to subsection (12), an Appeals Officer shall make a decision in relation to an appeal not later than 45 working days from the date of receipt of the appeal by him or her under subsection (1). (12) In exceptional circumstances, the Appeals Officer may take not more than 15 working days in addition to the number of days mentioned in subsection (11) to make a decision. (13) The Appeals Officer shall notify the master concerned, and the Authority, in writing of his or her decision and the reasons for it and the decision or reasons for the decision may be published on a website maintained by the Authority. (14) The Authority or the master concerned may apply to the High Court on a point of law regarding a decision of the Appeals Officer. (15) An application to the High Court under subsection (14) shall be made not later than 28 days after the notification to the parties of the decision of the Appeals Officer under subsection (13). (16) In this section appeal means an appeal under this section.   Notification of assignment of points Notification of assignment of points 15O. Where points are assigned to a master on the Irish Fishing Master Register under section 15I, the Minister shall notify the master in writing 15O.  (a) of the number of points which have been assigned, (b) the total number of points assigned to him or her which have not been deleted in accordance with section 15J(2), (c) where the master has accumulated points, such that, in accordance with section 15K, the registration of the master in the Irish Fishing Master Register is to be suspended, the start date and end date of the period of suspension, and (d) where the master has accumulated sufficient points or suspensions, such that, in accordance with section 15L, the master is to be removed from the Irish Fishing Master Register, that the master has been so removed. Service of notifications to masters Service of notifications to masters 15P. (1) Subject to subsection (2), a notification that is required to be made or a document or other material that is required to be sent to a master under this Chapter shall be addressed to the master by name, and may be made or sent in any of the following ways: 15P. (a) by giving a copy to the master, (b) by leaving it  (i) at the address at which the master ordinarily resides or, in a case in which an address for service has been furnished, at that address, or (ii) on the sea-fishing boat of which the master is for the time being the master, (c) by sending it by post in a prepaid registered letter to the address at which the master ordinarily resides or, in a case in which an address has been furnished, to that address, (d) in a case in which an email address has been furnished, by sending it to that email address, (e) in a case in which a master is registered on an electronic interface, by leaving it on that electronic interface, (f) where the master is mastering a sea-fishing boat that is at sea at the time of such making or sending, by email, satellite telephone or through the fisheries monitoring centre and by subsequent confirmation by any of the other methods referred to in this subsection, or (g) where the master is a national of another Member State, by a request to the other Member State for notification to that master in accordance with Article 161 of the Commission Regulation. (2) Where a notification is required to be made, or a document or other material is required to be sent, under this Chapter to a master who is a national of another Member State and the Authority does not have contact details for him or her, the notification may be made, or the document or other material may be sent, to the licence holder of the sea-fishing boat concerned in one of the following ways: (a) by giving a copy of the notification, or document or other material, to the licence holder, (b) by leaving it  (i) at the address at which the licence holder ordinarily resides, or in a case in which an address for service has been furnished, at that address, or (ii) on the sea-fishing boat for which the licence holder holds the licence, (c) by sending it by post in a prepaid registered letter to the address at which the licence holder ordinarily resides, or in a case in which an address has been furnished, to that address, or (d) in a case in which an email address has been furnished, by sending it to that email address. (3) For the purpose of this section, a company within the meaning of the Companies Act 2014 shall be deemed to be ordinarily resident at its registered office, and every other body corporate and every unincorporated body of persons shall be deemed to be ordinarily resident at its principal office or place of business. (4) In this section, electronic interface means a secure information technology platform, portal, exchange network or other similar interface maintained by, or on behalf of, the Minister which requires personal log-in details.   Matters relating to oral hearings Matters relating to oral hearings 15Q. (1) In conducting an oral hearing referred to in section 15H(2)(b)(v) or section 15N(3), the Determination Panel or Appeals Officer, as the case may be, may 15Q.  (a) by notice in writing to any person, require the person to attend at such time and place as is specified in the notice to give evidence in relation to any matter in question at the hearing or to produce any books, accounts, maps, plans or other documents in his or her possession, custody or control which relate to the matter, or (b) take evidence on oath and for that purpose may administer oaths, and a person giving evidence at an oral hearing shall be entitled to the same immunities and privileges as if he or she were a witness before the High Court. (2) Where a person requests an oral hearing under section 15H(2)(b)(v) or section 15N(3), and that person fails to attend at the scheduled hearing in accordance with a notice referred to in subsection (1)(a), the Determination Panel or the Appeals Officer, as the case may be, may make the determination or finding within the time specified in sections 15H(6) or 15N(11) notwithstanding a persons failure to attend at a scheduled hearing.  (3) A person to whom a notice referred to in subsection (1)(a) has been given who  (a) refuses or neglects to attend in accordance with the notice, (b) alters, suppresses, conceals or destroys any document to which the notice relates, or (c) having attended in accordance with the notice, refuses to give evidence or refuses or fails to produce any document to which the notice relates, commits an offence and is liable on summary conviction to a class C fine. Offence of employing person who is suspended or removed from Irish Fishing Master Register Offence of employing person who is suspended or removed from Irish Fishing Master Register 15R. (1) A holder of a sea-fishing boat licence shall not 15R.  (a) permit a person to take control of the sea-fishing boat to which the licence relates, or (b) engage a person as a master of the sea-fishing boat to which the licence relates, knowing that the person is an Irish citizen and is not registered in the Irish Fishing Master Register or that the registration of that person in that Register is suspended under section 15K. (2) A holder of a sea-fishing boat licence shall not  (a) permit a national of another Member State to take control of the sea-fishing boat to which the licence relates, or (b) engage such a national as a master of such a sea-fishing boat to which the licence relates, knowing that he or she has been suspended or removed from a register in the Member State equivalent to the Irish Fishing Master Register or has had his or her right or permission to master a sea-fishing boat permanently withdrawn under the law of that Member State that gives effect to Article 92 of the Control Regulation. (3) A person who contravenes subsection (1) or (2) commits an offence and is liable  (a) on summary conviction, to a class A fine, or (b) on conviction on indictment, to a fine not exceeding 15,000.  (4) In proceedings against the holder of a sea-fishing boat licence for a contravention of subsection (1)(a) or (2)(a), it shall be a defence for the defendant to prove that he or she permitted the person referred to in those paragraphs to take charge of the sea-fishing boat concerned in order to avert, or to seek to avert, an immediate or imminent danger to the sea-fishing boat or a person thereon. Consideration by Determination Panel and Appeals Officer of submissions Consideration by Determination Panel and Appeals Officer of submissions 15S. (1) A Determination Panel, in relation to an alleged serious infringement, may conduct a determination under this Chapter at the same time as conducting a determination in relation to the same serious infringement under the Regulations of 2020 acting as a Determination Panel under those Regulations and may, including during an oral hearing under section 15H(2)(b)(v) or under those Regulations, take evidence and hear and consider submissions relating to 15S.  (a) a master in respect of whom the alleged serious infringement has been detected under this Act, and (b) a holder of a sea-fishing boat licence in respect of whom the alleged serious infringement has been detected under the Regulations of 2020. (2) An Appeals Officer, in relation to an alleged serious infringement, may conduct an appeal under this Chapter at the same time as conducting an appeal in relation to the same serious infringement under the Regulations of 2020 acting as an Appeals Officer under those Regulations and may, including during an oral hearing under section 15N(3) or under those Regulations, take evidence and hear and consider submissions relating to  (a) a master in respect of whom the alleged serious infringement has been detected under this Act, and (b) a holder of a sea-fishing boat licence in respect of whom the alleged serious infringement has been detected under the Regulations of 2020. Extension of time limits Extension of time limits 15T. (1) Any time limit referred to in this Chapter within which any action is required to be taken or may not be taken, or anything is required to be done or may not be done, may be extended by the Determination Panel or the Appeals Officer, as the case may be, by such period as is necessary to align the time limit concerned with a corresponding time limit in the Regulations of 2020 relating to a determination or appeal under those Regulations arising out of the same alleged serious infringement. 15T. (2) Any time limit referred to in the Regulations of 2020 within which any action is required to be taken or may not be taken, or anything is required to be done or may not be done, may be extended by the Determination Panel or the Appeals Officer, as the case may be, within the meaning of those Regulations, by such period as is necessary to align the time limit concerned with a corresponding time limit in this Chapter relating to a determination or appeal under this Chapter arising out of the same alleged serious infringement. Points to be assigned for serious infringement specified in Article 90(1)(c) of Control Regulation Points to be assigned for serious infringement specified in Article 90(1)(c) of Control Regulation 15U. For the purposes of Article 90 of the Control Regulation, the number of points to be assigned in accordance with this Chapter for a serious infringement specified in paragraph (1)(c) of that Article shall be five.. 15U.  \n7.\n\nAmendment of section 16 of Act of 2006\n\n7. Section 16 of the Act of 2006 is amended in subsection (1)(c), by the insertion of or serving in the fisheries monitoring centre, after the State,.\n 7. \nAmendment of section 16 of Act of 2006\n Amendment of section 16 of Act of 2006 Amendment of section 16 of Act of 2006 7. Section 16 of the Act of 2006 is amended in subsection (1)(c), by the insertion of or serving in the fisheries monitoring centre, after the State,. 7.     \n8.\n\nAmendment of section 17 of Act of 2006\n\n8. Section 17 of the Act of 2006 is amended in subsection (1)(j)(i), by the substitution of paragraph (b)(i), (ii) or (v), for paragraph (b)(i) and (ii) and (v),.\n 8. \nAmendment of section 17 of Act of 2006\n Amendment of section 17 of Act of 2006 Amendment of section 17 of Act of 2006 8. Section 17 of the Act of 2006 is amended in subsection (1)(j)(i), by the substitution of paragraph (b)(i), (ii) or (v), for paragraph (b)(i) and (ii) and (v),. 8.     \n9.\n\nData Transfer\n\n9. Chapter 3 of Part 2 of the Act of 2006 is amended by the insertion of the following section after section 26:\nData Transfer\n26A. (1) (a) Information held by the Authority for the purposes of the Fisheries Acts 1959 to 2022 may be transferred by the Authority to the Revenue Commissioners.\n(b) Information held by the Revenue Commissioners for the purposes of a relevant Act relating to income derived from the fisheries sector may be transferred by the Revenue Commissioners to the Authority.\n(2) In this section, relevant Act means\n(a) an Act that is a Tax Act within the meaning of section 1(2) of the Taxes Consolidation Act 1997, or\n(b) the Value-Added Tax Consolidation Act 2010..\n 9. \nData Transfer\n Data Transfer Data Transfer 9. Chapter 3 of Part 2 of the Act of 2006 is amended by the insertion of the following section after section 26: 9. Data Transfer Data Transfer  26A. (1) (a) Information held by the Authority for the purposes of the Fisheries Acts 1959 to 2022 may be transferred by the Authority to the Revenue Commissioners. 26A. Fisheries Acts 1959 to 2022 (b) Information held by the Revenue Commissioners for the purposes of a relevant Act relating to income derived from the fisheries sector may be transferred by the Revenue Commissioners to the Authority. (2) In this section, relevant Act means    (a) an Act that is a Tax Act within the meaning of section 1(2) of the Taxes Consolidation Act 1997, or (b) the Value-Added Tax Consolidation Act 2010..  \n10.\n\nAmendment of section 28 of Act of 2006\n\n10. Section 28 of the Act of 2006 is amended\n(a) in subsection (5), by the substitution of the following paragraph for paragraph (b):\n(b) in the case of a conviction under any other provision mentioned in a Table, any fish and fishing gear found on the boat to which the offence relates or found in any other place to which they had been moved from the boat are, as a statutory consequence of the conviction, forfeited.,\n(b) in subsection (6)(b), by the deletion of all or any of,\n(c) in column (2) of Table 1, opposite Reference Number 1(b), by the substitution of a contravention relating to fishing gear or equipment for illegal nets or other equipment,\n(d) in column (2) of Table 1, opposite Reference Number 2, by the substitution of 10(4) for 10(2), and\n(e) in column (2) of Table 2, opposite Reference Number 1, by the substitution of Section 4(13) (fishing without or in contravention of a sea-fishing boat licence). for Section 4(12) (fishing without or in contravention of sea-fishing boat licence)..\n 10. \nAmendment of section 28 of Act of 2006\n Amendment of section 28 of Act of 2006 Amendment of section 28 of Act of 2006 10. Section 28 of the Act of 2006 is amended 10.  (a) in subsection (5), by the substitution of the following paragraph for paragraph (b): (b) in the case of a conviction under any other provision mentioned in a Table, any fish and fishing gear found on the boat to which the offence relates or found in any other place to which they had been moved from the boat are, as a statutory consequence of the conviction, forfeited.,   (b) in subsection (6)(b), by the deletion of all or any of,   (c) in column (2) of Table 1, opposite Reference Number 1(b), by the substitution of a contravention relating to fishing gear or equipment for illegal nets or other equipment,     (d) in column (2) of Table 1, opposite Reference Number 2, by the substitution of 10(4) for 10(2), and     (e) in column (2) of Table 2, opposite Reference Number 1, by the substitution of Section 4(13) (fishing without or in contravention of a sea-fishing boat licence). for Section 4(12) (fishing without or in contravention of sea-fishing boat licence)..     \n11.\n\nAmendment of section 37 of Act of 2006\n\n11. Section 37 of the Act of 2006 is amended in paragraph (b), by the substitution of any fishing gear or for any nets or.\n 11. \nAmendment of section 37 of Act of 2006\n Amendment of section 37 of Act of 2006 Amendment of section 37 of Act of 2006 11. Section 37 of the Act of 2006 is amended in paragraph (b), by the substitution of any fishing gear or for any nets or. 11.     \n12.\n\nAmendment of section 54 of Act of 2006\n\n12. Section 54 of the Act of 2006 is amended in paragraph (b), by the substitution of 51(2), for 51(2)(a),.\n 12. \nAmendment of section 54 of Act of 2006\n Amendment of section 54 of Act of 2006 Amendment of section 54 of Act of 2006 12. Section 54 of the Act of 2006 is amended in paragraph (b), by the substitution of 51(2), for 51(2)(a),. 12.     \n13.\n\nAmendment of Fisheries (Amendment) Act 2003\n\n13. The Fisheries (Amendment) Act 2003 is amended\n(a) in section 4(3)(b) (amended by section 97 of the Act of 2006)\n(i) in subparagraph (iii), by the substitution of application is made, for application is made., and\n(ii) by the insertion of the following subparagraph after subparagraph (iii):\n(iv) where the applicant is a natural person, made by a person who is over 18 years of age at the date of the application.,\nand\n(b) in section 5 (amended by section 99(c) of the Act of 2006)\n(i) in subsection (1)(b), by the deletion of of the 2003 Act, and\n(ii) in subsection (2)(b), by the deletion of of the 2003 Act.\n 13. \nAmendment of Fisheries (Amendment) Act 2003\n Amendment of Fisheries (Amendment) Act 2003 Amendment of Fisheries (Amendment) Act 2003 13. The Fisheries (Amendment) Act 2003 is amended 13.  (a) in section 4(3)(b) (amended by section 97 of the Act of 2006)  (i) in subparagraph (iii), by the substitution of application is made, for application is made., and     (ii) by the insertion of the following subparagraph after subparagraph (iii): (iv) where the applicant is a natural person, made by a person who is over 18 years of age at the date of the application.,   and (b) in section 5 (amended by section 99(c) of the Act of 2006)  (i) in subsection (1)(b), by the deletion of of the 2003 Act, and   (ii) in subsection (2)(b), by the deletion of of the 2003 Act.   \n14.\n\nAmendment of European Union (Common Fisheries Policy) (Point System) Regulations 2020\n\n14. Regulation 7 of the European Union (Common Fisheries Policy) (Point System) Regulations 2020 (S.I. No. 318 of 2020) is amended\n(a) by the insertion of the following paragraph after paragraph (2):\n(2A) Subject to paragraph (3), where a notification has been issued under paragraph (1) in respect of an Irish sea-fishing boat, the Authority shall assign the appropriate number of points to the holder of the Irish licence relating to the boat concerned for the serious infringement.,\n(b) in paragraph (3), by the substitution of in accordance with paragraph (2A) for in accordance with paragraph (1), and\n(c) in paragraph (4)(b)\n(i) in clause (i), by the substitution of the points are to be assigned for the proposed points are to be assigned, and\n(ii) in clause (iv), by the substitution of the number of points assigned for the number of points to be assigned.\n 14. \nAmendment of European Union (Common Fisheries Policy) (Point System) Regulations 2020\n Amendment of European Union (Common Fisheries Policy) (Point System) Regulations 2020 Amendment of European Union (Common Fisheries Policy) (Point System) Regulations 2020 14. Regulation 7 of the European Union (Common Fisheries Policy) (Point System) Regulations 2020 (S.I. No. 318 of 2020) is amended 14.  (a) by the insertion of the following paragraph after paragraph (2): (2A) Subject to paragraph (3), where a notification has been issued under paragraph (1) in respect of an Irish sea-fishing boat, the Authority shall assign the appropriate number of points to the holder of the Irish licence relating to the boat concerned for the serious infringement.,   (b) in paragraph (3), by the substitution of in accordance with paragraph (2A) for in accordance with paragraph (1), and     (c) in paragraph (4)(b)  (i) in clause (i), by the substitution of the points are to be assigned for the proposed points are to be assigned, and     (ii) in clause (iv), by the substitution of the number of points assigned for the number of points to be assigned.     \n15.\n\nShort title, collective citation and commencement\n\n15. (1) This Act may be cited as the Sea-Fisheries (Miscellaneous Provisions) Act 2022.\n(2) The Sea-Fisheries Acts 2003 to 2019 and sections  1 to  13 may be cited together as the Sea-Fisheries Acts 2003 to 2022.\n(3) The Fisheries Acts 1959 to 2019 and sections  1 to  13 may be cited together as the Fisheries Acts 1959 to 2022.\n(4) This Act shall come into operation on such day or days as the Minister for Agriculture, Food and the Marine may by order or orders appoint either generally or with reference to any particular purpose or provision and different days may be so appointed for different purposes or different provisions.\n 15. \nShort title, collective citation and commencement\n Short title, collective citation and commencement Short title, collective citation and commencement 15. (1) This Act may be cited as the Sea-Fisheries (Miscellaneous Provisions) Act 2022. 15. (2) The Sea-Fisheries Acts 2003 to 2019 and sections  1 to  13 may be cited together as the Sea-Fisheries Acts 2003 to 2022. sections  1  13 (3) The Fisheries Acts 1959 to 2019 and sections  1 to  13 may be cited together as the Fisheries Acts 1959 to 2022. sections  1  13 (4) This Act shall come into operation on such day or days as the Minister for Agriculture, Food and the Marine may by order or orders appoint either generally or with reference to any particular purpose or provision and different days may be so appointed for different purposes or different provisions. 7. \nAmendment of section 16 of Act of 2006\n Amendment of section 16 of Act of 2006 Amendment of section 16 of Act of 2006 7. Section 16 of the Act of 2006 is amended in subsection (1)(c), by the insertion of or serving in the fisheries monitoring centre, after the State,. 7.     8. \nAmendment of section 17 of Act of 2006\n Amendment of section 17 of Act of 2006 Amendment of section 17 of Act of 2006 8. Section 17 of the Act of 2006 is amended in subsection (1)(j)(i), by the substitution of paragraph (b)(i), (ii) or (v), for paragraph (b)(i) and (ii) and (v),. 8.     9. \nData Transfer\n Data Transfer Data Transfer 9. Chapter 3 of Part 2 of the Act of 2006 is amended by the insertion of the following section after section 26: 9. Data Transfer Data Transfer  26A. (1) (a) Information held by the Authority for the purposes of the Fisheries Acts 1959 to 2022 may be transferred by the Authority to the Revenue Commissioners. 26A. Fisheries Acts 1959 to 2022 (b) Information held by the Revenue Commissioners for the purposes of a relevant Act relating to income derived from the fisheries sector may be transferred by the Revenue Commissioners to the Authority. (2) In this section, relevant Act means    (a) an Act that is a Tax Act within the meaning of section 1(2) of the Taxes Consolidation Act 1997, or (b) the Value-Added Tax Consolidation Act 2010..  10. \nAmendment of section 28 of Act of 2006\n Amendment of section 28 of Act of 2006 Amendment of section 28 of Act of 2006 10. Section 28 of the Act of 2006 is amended 10.  (a) in subsection (5), by the substitution of the following paragraph for paragraph (b): (b) in the case of a conviction under any other provision mentioned in a Table, any fish and fishing gear found on the boat to which the offence relates or found in any other place to which they had been moved from the boat are, as a statutory consequence of the conviction, forfeited.,   (b) in subsection (6)(b), by the deletion of all or any of,   (c) in column (2) of Table 1, opposite Reference Number 1(b), by the substitution of a contravention relating to fishing gear or equipment for illegal nets or other equipment,     (d) in column (2) of Table 1, opposite Reference Number 2, by the substitution of 10(4) for 10(2), and     (e) in column (2) of Table 2, opposite Reference Number 1, by the substitution of Section 4(13) (fishing without or in contravention of a sea-fishing boat licence). for Section 4(12) (fishing without or in contravention of sea-fishing boat licence)..     11. \nAmendment of section 37 of Act of 2006\n Amendment of section 37 of Act of 2006 Amendment of section 37 of Act of 2006 11. Section 37 of the Act of 2006 is amended in paragraph (b), by the substitution of any fishing gear or for any nets or. 11.     12. \nAmendment of section 54 of Act of 2006\n Amendment of section 54 of Act of 2006 Amendment of section 54 of Act of 2006 12. Section 54 of the Act of 2006 is amended in paragraph (b), by the substitution of 51(2), for 51(2)(a),. 12.     13. \nAmendment of Fisheries (Amendment) Act 2003\n Amendment of Fisheries (Amendment) Act 2003 Amendment of Fisheries (Amendment) Act 2003 13. The Fisheries (Amendment) Act 2003 is amended 13.  (a) in section 4(3)(b) (amended by section 97 of the Act of 2006)  (i) in subparagraph (iii), by the substitution of application is made, for application is made., and     (ii) by the insertion of the following subparagraph after subparagraph (iii): (iv) where the applicant is a natural person, made by a person who is over 18 years of age at the date of the application.,   and (b) in section 5 (amended by section 99(c) of the Act of 2006)  (i) in subsection (1)(b), by the deletion of of the 2003 Act, and   (ii) in subsection (2)(b), by the deletion of of the 2003 Act.   14. \nAmendment of European Union (Common Fisheries Policy) (Point System) Regulations 2020\n Amendment of European Union (Common Fisheries Policy) (Point System) Regulations 2020 Amendment of European Union (Common Fisheries Policy) (Point System) Regulations 2020 14. Regulation 7 of the European Union (Common Fisheries Policy) (Point System) Regulations 2020 (S.I. No. 318 of 2020) is amended 14.  (a) by the insertion of the following paragraph after paragraph (2): (2A) Subject to paragraph (3), where a notification has been issued under paragraph (1) in respect of an Irish sea-fishing boat, the Authority shall assign the appropriate number of points to the holder of the Irish licence relating to the boat concerned for the serious infringement.,   (b) in paragraph (3), by the substitution of in accordance with paragraph (2A) for in accordance with paragraph (1), and     (c) in paragraph (4)(b)  (i) in clause (i), by the substitution of the points are to be assigned for the proposed points are to be assigned, and     (ii) in clause (iv), by the substitution of the number of points assigned for the number of points to be assigned.     15. \nShort title, collective citation and commencement\n Short title, collective citation and commencement Short title, collective citation and commencement 15. (1) This Act may be cited as the Sea-Fisheries (Miscellaneous Provisions) Act 2022. 15. (2) The Sea-Fisheries Acts 2003 to 2019 and sections  1 to  13 may be cited together as the Sea-Fisheries Acts 2003 to 2022. sections  1  13 (3) The Fisheries Acts 1959 to 2019 and sections  1 to  13 may be cited together as the Fisheries Acts 1959 to 2022. sections  1  13 (4) This Act shall come into operation on such day or days as the Minister for Agriculture, Food and the Marine may by order or orders appoint either generally or with reference to any particular purpose or provision and different days may be so appointed for different purposes or different provisions.",
                "description": "An Act to amend the Sea-Fisheries and Maritime Jurisdiction Act 2006 to give effect to Article 92 of Council Regulation (EC) No. 1224/2009 of 20 November 200911 OJ No. L 343, 22.12.2009, p.1 and Title VII of Commission Implementing Regulation (EU) No. 404/2011 of 8 April 201122 OJ No. L 112, 30.4.2011, p. 1 and in that regard to provide for a system of registration and assignment of points to masters of sea-fishing boats who are Irish citizens; to make provision for certain other amendments to the Sea-Fisheries and Maritime Jurisdiction Act 2006; to amend the Fisheries (Amendment) Act 2003; to amend the European Union (Common Fisheries Policy) (Point System) Regulations 2020 (S.I. No. 318 of 2020); and to provide for related matters. "
            },
            {
                "url": "https://www.irishstatutebook.ie/eli/2022/act/3/enacted/en/xml",
                "title": "Redundancy Payments (Amendment) Act 2022",
                "description": "An Act to amend the Redundancy Payments Act 1967 to provide for payments to employees in respect of certain lay-off periods during the period beginning on 13 March 2020 and ending on 31 January 2022; to amend the Companies (Corporate Enforcement Authority) Act 2021; and to provide for related matters.",
                "details": " 1. \nDefinition\n Definition Definition 1. In this Act, Principal Act means the Redundancy Payments Act 1967. 1.   2. \nCovid-19 related lay-off payment\n Covid-19 related lay-off payment Covid-19 related lay-off payment 2. The Principal Act is amended by the insertion of the following section after section 32: 2. 32A. (1) This section applies to an employee  32A  (a) who is entitled to a redundancy payment under section 7, (b) whose entitlement to a lump sum payment under section 19 arises during the period beginning on 13 March 2020 and ending on 31 January 2025, and (c) who was laid off during the period beginning on 13 March 2020 and ending on 31 January 2022 due to the effect of measures required to be taken by his or her employer in order to comply with, or as a consequence of, Government policy to prevent, limit, minimise or slow the spread of infection of Covid-19. (2) An employer, on behalf of an employee to whom this section applies, may apply to the Minister for a payment in respect of any periods of lay-off referred to in subsection (1)(c) in the manner determined by the Minister. (3) If an employer refuses or fails to apply to the Minister on the employees behalf for a payment under subsection (2), the employee may apply to the Minister for the payment.  (4) For the purposes of determining an application under this section, a deciding officer may, by notice in writing, require the employer or the employee, as the case may be, to provide such information or documents as are specified in the notice that, in the deciding officers opinion, are required for the purpose of determining whether the employee is entitled to a payment under this section.  (5) The notice under subsection (4) shall specify the period, which may be extended by the deciding officer for good reason, within which the information or documents shall be provided. (6) If, on an application under this section, the Minister is satisfied that the employee is entitled to a payment under this section, the Minister shall pay the sum to the employee out of the Social Insurance Fund. (7) The amount of a payment under this section is the difference between  (a) the amount of the lump sum payable under section 19 or 32, and (b) the amount of the lump sum determined under subparagraph 1 of Schedule 3 as if any periods of lay-off during the period referred to in subsection (1)(c) were included in the calculations of reckonable service within the meaning of Schedule 3. (8) Where the amount of a payment payable to an employee under this section is disallowed or reduced by virtue of a revised decision of a deciding officer under section 41, any payment, or part of a payment, paid under the original decision shall be repayable by the employee to the Social Insurance Fund. (9) The Minister may by regulations provide for the method of recovery of an amount repayable by an employee under subsection (8)..  3. \nAmendment of section 38 of Principal Act\n Amendment of section 38 of Principal Act Amendment of section 38 of Principal Act 3. Section 38 of the Principal Act is amended, in subsection (1), by the substitution of the following paragraph for paragraph (b): 3. (b) in relation to the payment from the Social Insurance Fund of   (i) rebates to employers under section 29, (ii) lump sums to employees under section 32, or (iii) payments to employees under section 32A(6) in respect of certain lay-off periods during the period referred to in section 32A(1)(c), or.  4. \nAmendment of Act of 2021\n Amendment of Act of 2021 Amendment of Act of 2021 4. (1) Section 11 of the Act of 2021 is amended by the substitution of Schedule 1 for Schedule 2. 4.  Schedule 1   Schedule 2  (2) This section shall come into operation on the day on which section 11 of the Act of 2021 comes into operation. (3) In this section, Act of 2021 means the Companies (Corporate Enforcement Authority) Act 2021.   5. \nShort title, collective citation and commencement\n Short title, collective citation and commencement Short title, collective citation and commencement 5. (1) This Act may be cited as the Redundancy Payments (Amendment) Act 2022. 5. (2) The Redundancy Payments Acts 1967 to 2014 and this Act, other than section 4, may be cited together as the Redundancy Payments Acts 1967 to 2022. section 4 (3) This Act, other than section 4, shall come into operation on such day or days as the Minister for Enterprise, Trade and Employment may by order or orders appoint either generally or with reference to any particular purpose or provision and different days may be so appointed for different purposes or different provisions. section 4"
            }
        ]
    }
}