{
	"2022": {
		"acts": [
			{
				"title": "ELECTRICITY COSTS (DOMESTIC ELECTRICITY ACCOUNTS) EMERGENCY MEASURES ACT 2022",
				"description": "An Act to make provision, due to the exceptional rise in global energy prices, for the establishment of a scheme to be known as the Electricity Costs Emergency Benefit Scheme for the purpose of making, on a once-off basis, an electricity costs emergency benefit payment in the year ending 31 December 2022 in respect of domestic electricity accounts in accordance with this Act out of resources available to the Minister for the Environment, Climate and Communications; for that purpose to confer functions on the distribution system operator and electricity suppliers; to confer functions on the Commission for Regulation of Utilities in relation to the Scheme and for that purpose to amend the Electricity Regulation Act 1999; to provide that electricity costs emergency benefit payments are exempt from income tax and for that purpose to amend the Taxes Consolidation Act 1997; to enable the Minister for the Environment, Climate and Communications to make regulations in relation to the operation of the Scheme; and to provide for related matters."	
			},
			{
				"title": "Sea-Fisheries (Miscellaneous Provisions) Act 2022",
				"description": "An Act to amend the Sea-Fisheries and Maritime Jurisdiction Act 2006 to give effect to Article 92 of Council Regulation (EC) No. 1224/2009 of 20 November 200911 OJ No. L 343, 22.12.2009, p.1 and Title VII of Commission Implementing Regulation (EU) No. 404/2011 of 8 April 201122 OJ No. L 112, 30.4.2011, p. 1 and in that regard to provide for a system of registration and assignment of points to masters of sea-fishing boats who are Irish citizens; to make provision for certain other amendments to the Sea-Fisheries and Maritime Jurisdiction Act 2006; to amend the Fisheries (Amendment) Act 2003; to amend the European Union (Common Fisheries Policy) (Point System) Regulations 2020 (S.I. No. 318 of 2020); and to provide for related matters. "	
			},
			{
				"title": "Redundancy Payments (Amendment) Act 2022",
				"description": "An Act to amend the Redundancy Payments Act 1967 to provide for payments to employees in respect of certain lay-off periods during the period beginning on 13 March 2020 and ending on 31 January 2022; to amend the Companies (Corporate Enforcement Authority) Act 2021; and to provide for related matters."	
			}
		]
	}
}