[
            {
                "url": "https://www.irishstatutebook.ie/eli/2022/act/1/enacted/en/xml",
                "title": "ELECTRICITY COSTS (DOMESTIC ELECTRICITY ACCOUNTS) EMERGENCY MEASURES ACT 2022",
                "description": "An Act to make provision, due to the exceptional rise in global energy prices, for the establishment of a scheme to be known as the Electricity Costs Emergency Benefit Scheme for the purpose of making, on a once-off basis, an electricity costs emergency benefit payment in the year ending 31 December 2022 in respect of domestic electricity accounts in accordance with this Act out of resources available to the Minister for the Environment, Climate and Communications; for that purpose to confer functions on the distribution system operator and electricity suppliers; to confer functions on the Commission for Regulation of Utilities in relation to the Scheme and for that purpose to amend the Electricity Regulation Act 1999; to provide that electricity costs emergency benefit payments are exempt from income tax and for that purpose to amend the Taxes Consolidation Act 1997; to enable the Minister for the Environment, Climate and Communications to make regulations in relation to the operation of the Scheme; and to provide for related matters."
            },
            {
                "url": "https://www.irishstatutebook.ie/eli/2022/act/2/enacted/en/xml",
                "title": "Sea-Fisheries (Miscellaneous Provisions) Act 2022",
                "description": "An Act to amend the Sea-Fisheries and Maritime Jurisdiction Act 2006 to give effect to Article 92 of Council Regulation (EC) No. 1224/2009 of 20 November 200911 OJ No. L 343, 22.12.2009, p.1 and Title VII of Commission Implementing Regulation (EU) No. 404/2011 of 8 April 201122 OJ No. L 112, 30.4.2011, p. 1 and in that regard to provide for a system of registration and assignment of points to masters of sea-fishing boats who are Irish citizens; to make provision for certain other amendments to the Sea-Fisheries and Maritime Jurisdiction Act 2006; to amend the Fisheries (Amendment) Act 2003; to amend the European Union (Common Fisheries Policy) (Point System) Regulations 2020 (S.I. No. 318 of 2020); and to provide for related matters. "
            },
            {
                "url": "https://www.irishstatutebook.ie/eli/2022/act/3/enacted/en/xml",
                "title": "Redundancy Payments (Amendment) Act 2022",
                "description": "An Act to amend the Redundancy Payments Act 1967 to provide for payments to employees in respect of certain lay-off periods during the period beginning on 13 March 2020 and ending on 31 January 2022; to amend the Companies (Corporate Enforcement Authority) Act 2021; and to provide for related matters."
            },
            {
                "url": "https://www.irishstatutebook.ie/eli/2022/act/4/enacted/en/xml",
                "title": "Animal Health and Welfare and Forestry (Miscellaneous Provisions) Act 2022",
                "description": "An Act to amend the Animal Health and Welfare Act 2013 to provide for the prohibition of the breeding, rearing or keeping of specified animals solely or primarily for the value of, or the manufacture of products from, their fur or skin; to provide for a system of compensation to persons who before the coming into operation of the prohibition were engaged in the fur farming of mink pursuant to a licence under the Musk Rats Act 1933; to confer on the Minister for Agriculture, Food and the Marine the power to make regulations for the purpose of licensing livestock marts; to repeal certain provisions of the Animal Health and Welfare Act 2013 relating to the licensing of animal marts; to amend the Forestry Act 2014 to make provision for schemes to facilitate the planting of native tree areas; to repeal the Milk (Miscellaneous Provisions) Act 1979; and to provide for related matters."
            },
            {
                "url": "https://www.irishstatutebook.ie/eli/2022/act/5/enacted/en/xml",
                "title": "Consumer Protection (Regulation of Retail Credit and Credit Servicing Firms) Act 2022",
                "description": "An Act to provide for the extension of authorisation requirements to persons carrying on hire-purchase or consumer-hire business or providing credit indirectly and persons carrying on business relating to hire-purchase or consumer-hire agreements or the indirect provision of credit; to provide for the collection and publication of information on credit agreements, hire-purchase agreements and consumer-hire agreements; for those and other purposes to amend the Central Bank Act 1997; to provide for a limit on the interest rate that consumers may be charged under credit agreements and hire-purchase agreements; to provide for a requirement to include the annual percentage rate in a hire-purchase agreement; for those and other purposes to amend the Consumer Credit Act 1995 and to provide for related matters."
            },
            {
                "url": "https://www.irishstatutebook.ie/eli/2022/act/6/enacted/en/xml",
                "title": "HEALTH (MISCELLANEOUS PROVISIONS) ACT 2022",
                "description": "An Act to amend the Health Act 2004 to provide for the conferral of certain functions on the Minister for Children, Equality, Disability, Integration and Youth; to provide for consultation in certain matters between, and joint functions of, the Minister for Health and the Minister for Children, Equality, Disability, Integration and Youth; to provide for revised corporate governance and accountability arrangements of the Health Service Executive; to amend the Disability Act 2005; to amend the Health Act 2007; and to provide for related matters."
            },
            {
                "url": "https://www.irishstatutebook.ie/eli/2022/act/7/enacted/en/xml",
                "title": "GARDA SÍOCHÁNA (FUNCTIONS AND OPERATIONAL AREAS) ACT 2022",
                "description": "An Act to amend certain enactments, consequent upon changes in the manner in which the Garda Síochána are to be distributed and stationed throughout the State; to provide that references in certain enactments to Garda districts are to be, or to be construed as, references to Garda Sochna divisions; to provide that specified functions of members of the Garda Sochna under certain enactments may be performed by members of a different rank; to amend certain enactments to provide that references to a district be references to an area; to amend the Firearms Act 1925 to provide for the delegation of specified functions of a superintendent under that Act to an Inspector; to provide that notifications under the Sex Offenders Act 2001 and the Criminal Justice Act 2006 can take place at Garda Sochna stations designated by the Commissioner of the Garda Sochna; to empower the Minister to make regulations to amend statutory instruments in order to give effect to a determination of the Commissioner of the Garda Sochna under section 33(1) of the Garda Sochna Act 2005; to make transitional arrangements in respect of the aforementioned changes; to provide for the revocation of the Garda Siochana (Designations, Appointments and Discipline) Regulations 1924; to amend the Garda Sochna Act 2005 by amending Schedule 5 and by creating regulation-making powers in order to make provision for a testing regime of members and certain other persons to detect the presence of controlled drugs or psychoactive substances in samples provided, to prohibit their presence in specified concentrations other than where exposure in the course of functions or employment occurs and to make provision for disciplinary sanctions relating to these matters; and to provide for related matters."
            },
            {
                "url": "https://www.irishstatutebook.ie/eli/2022/act/8/enacted/en/xml",
                "title": "MERCHANT SHIPPING (INVESTIGATION OF MARINE CASUALTIES) (AMENDMENT) ACT 2022",
                "description": "An Act to amend the Merchant Shipping (Investigation of Marine Casualties) Act 2000 to provide for an amendment to the composition of the Marine Casualty Investigation Board; to provide for notification of marine casualties to the Board; to provide for notification of marine casualties to the Marine Survey Office; to amend the definition of Safety Convention in the Merchant Shipping (Safety Convention) Act 1952; and to provide for related matters."
            },
            {
                "url": "https://www.irishstatutebook.ie/eli/2022/act/9/enacted/en/xml",
                "title": "Finance (Covid-19 and Miscellaneous Provisions) Act 2022",
                "description": "An Act to provide for the imposition, repeal, remission, alteration and regulation of taxation, of stamp duties and of duties relating to excise; to otherwise make further provision in connection with finance; to make provision for the exemption from income tax of the payment generally referred to and commonly known as the Pandemic Special Recognition Payment and for that purpose to amend the Taxes Consolidation Act 1997; to make provision for supports to employers and certain businesses and for that purpose to amend Part 7 of the Emergency Measures in the Public Interest (Covid-19) Act 2020, the Taxes Consolidation Act 1997, the Social Welfare Consolidation Act 2005 and the Value-Added Tax Consolidation Act 2010; to provide for the repayment of stamp duty on cost rental dwellings and for that purpose to amend the Stamp Duties Consolidation Act 1999; to provide for the waiver of excise duty charged on certain special exemption orders granted under section 5 of the Intoxicating Liquor Act 1927; to provide for the tax treatment of certain payments to holders of sea-fishing boat licences arising under a scheme to be established by the Minister for Agriculture, Food and the Marine pursuant to Regulation (EU) 2021/1755 of the European Parliament and of the Council of 6 October 202111 OJ No. L 357, 8.10.2021, p. 1 and for that purpose to amend the Taxes Consolidation Act 1997; to provide for cost recovery mechanisms in relation to the Central Bank of Ireland, as operator of two beneficial ownership registers; and to provide for related matters."
            },
            {
                "url": "https://www.irishstatutebook.ie/eli/2022/act/10/enacted/en/xml",
                "title": "GARDA SÍOCHÁNA (AMENDMENT) ACT 2022",
                "description": "An Act to amend section 8 of the Garda Síochána Act 2005; and to provide for related matters."
            },
            {
                "url": "https://www.irishstatutebook.ie/eli/2022/act/11/enacted/en/xml",
                "title": "INSURANCE (MISCELLANEOUS PROVISIONS) ACT 2022",
                "description": "An Act to enable the collection by the Central Bank of Ireland of certain information regarding deductions by insurance undertakings from amounts paid in satisfaction of claims and, for that purpose, to amend the Central Bank (National Claims Information Database) Act 2018; to provide for the preparation of a report by the Central Bank of Ireland on certain practices of insurance undertakings regarding pricing; to amend the law regarding mutual duties of disclosure in relation to information supporting or prejudicing the validity of insurance claims, to provide for the disclosure by insurance undertakings of information in relation to deductions from amounts paid in satisfaction of claims and to amend the law in relation to exclusions from contracts of insurance and, for those purposes, to amend the Consumer Insurance Contracts Act 2019; to amend the European Union (Insurance and Reinsurance) Regulations 2015, as regards undertakings authorised in the United Kingdom or Gibraltar which are carrying on reinsurance business or subject to winding-up proceedings or reorganisation measures; and to provide for related matters."
            },
            {
                "url": "https://www.irishstatutebook.ie/eli/2022/act/12/enacted/en/xml",
                "title": "COMPETITION (AMENDMENT) ACT 2022",
                "description": "An Act to give effect to the implementation of Directive (EU) 2019/1 of the European Parliament and of the Council of 11 December 201811 OJ No. L 11 14.1.2019, p. 3 to empower the competition authorities of the Member States to be more effective enforcers and to ensure the proper functioning of the internal market; for that purpose to provide for a system of non‑criminal enforcement of certain provisions of competition law, including the appointment and empowerment of independent adjudication officers, and the issuing of prohibition notices in response to certain suspected infringements of competition law; to provide for a system of enforcement and non-criminal penalties in relation to certain breaches of competition law, including by the imposition of non-criminal structural and behavioural remedies and certain non-criminal financial sanctions, and to provide for processes by which such non-criminal sanctions may be appealed, remitted or confirmed by the High Court; to provide for a leniency programme in relation to certain undertakings; to provide for cooperation between competition authorities in the European Union and certain bodies in the State; to increase the penalties for certain criminal offences for breach of competition law; to provide additional powers of surveillance to the Competition and Consumer Protection Commission in relation to the investigation of certain criminal offences; to amend certain provisions relating to the procedure for notifying mergers to the relevant authorities; to make provision relating to the period of time within which certain proceedings relating to competition law may be brought; to make further provision regarding the power of the National Standards Authority of Ireland to charge fees in respect of certain matters; for those and other purposes to amend the Competition Act 2002, the Competition and Consumer Protection Act 2014, the Communications Regulation Act 2002, the Consumer Protection Act 2007, the National Standards Authority of Ireland Act 1996 and the Criminal Justice (Surveillance) Act 2009; and to provide for related matters."
            },
            {
                "url": "https://www.irishstatutebook.ie/eli/2022/act/13/enacted/en/xml",
                "title": "CONSUMER CREDIT (AMENDMENT) ACT 2022",
                "description": "An Act to amend the law in relation to providers of high cost credit, including in relation to the licensing of such persons, and for that purpose to amend the Consumer Credit Act 1995 and to make consequential amendments to other enactments; and to provide for related matters."
            },
            {
                "url": "https://www.irishstatutebook.ie/eli/2022/act/14/enacted/en/xml",
                "title": "Birth Information and Tracing Act 2022",
                "description": "An Act to make further and better provision in respect of access by certain persons to information concerning their origins and, for that purpose, to provide for the access by adopted persons and persons who have been the subject of incorrect birth registrations or certain care arrangements to their birth certificates and other information and items relating to them; to provide, where such persons are deceased, for the access in certain circumstances by their children or other next of kin to such information or items; to provide for the making available, by the Adoption Authority of Ireland and the Child and Family Agency, of a service for the tracing of certain persons; to provide for the establishment and maintenance of a register to be known as the Contact Preference Register; to provide for the safeguarding and transfer to the Adoption Authority of Ireland of certain records relating to the birth, adoption and care of certain persons; to amend the Succession Act 1965 to make provision in respect of persons who have been the subject of incorrect birth registrations; to amend the Civil Registration Act 2004 to make additional provision in respect of persons who are the subject of incorrect birth registrations; to amend the National Archives Act 1986; to amend the Adoption Act 2010; and to provide for related matters."
            },
            {
                "url": "https://www.irishstatutebook.ie/eli/2022/act/15/enacted/en/xml",
                "title": "Regulation of Providers of Building Works and Miscellaneous Provisions Act 2022",
                "description": "An Act to provide for the establishment of a register to be known in the Irish language as Clár Tionscail Foirgníochta na hÉireann and in the English language as the Construction Industry Register Ireland; to provide for appointment, by order of the Government, of a body to be the registration body to regulate providers of building works; to provide for determination by the registration body of standards and competence required of providers of building works; to cause any complaints against those providers to be investigated and adjudicated upon; to establish an appeals committee to hear and determine appeals against certain decisions of the registration body; to appoint the registration body to be the competent authority for the purposes of the European Union (Recognition of Professional Qualifications) Regulations 2017 (S.I. No. 8 of 2017); to amend the Building Control Act 2007; to amend the Nursing Homes Support Scheme Act 2009 by providing for certain rental income of a person who is receiving care services or his or her partner under a tenancy of the principal residence of that person to be assessed at a lower rate than other income of that person; to enable the rate at which such rental income is to be assessed to be reduced or to enable such rental income to be disregarded; to amend the Residential Tenancies Act 2004 by providing for an increase of the notice period for termination of certain tenancies, to require landlords to serve a copy of any notice of termination on the Board, and to enable the Board to assist in providing contact details of tenants to landlords for the purpose of facilitating a reletting offer; to amend the Housing (Regulation of Approved Housing Bodies) Act 2019 by providing for an increase of the period permitted for an application for registration as an approved housing body; to amend the Affordable Housing Act 2021; and to provide for related matters."
            },
            {
                "url": "https://www.irishstatutebook.ie/eli/2022/act/16/enacted/en/xml",
                "title": "DEFENCE FORCES (EVIDENCE) ACT 2022",
                "description": "An Act to amend the law to authorise the taking of bodily samples from military persons suspected of certain offences under military law for forensic testing; to provide for the taking of certain bodily samples from military persons or other persons who volunteer to have such samples taken from them for the purpose of the investigation of offences or incidents that may have involved the commission of offences under military law; to provide for the establishment and operation by Forensic Science Ireland of the Department of Justice and Equality of a DNA (Military Police) Database System; to provide for the purposes of that System; to provide for the taking of certain bodily samples from persons suspected of certain offences under military law for the purpose of generating DNA profiles in respect of those persons to be entered in the DNA (Military Police) Database System; to provide for the taking of certain bodily samples from certain persons for elimination purposes and, where appropriate, the entry of their DNA profiles in the DNA (Military Police) Database System; to provide for the taking of bodily samples from military persons, or samples from things, for the purpose of generating DNA profiles to be entered in the DNA (Military Police) Database System; to provide for the collection and analysis of other evidence; to provide, in certain circumstances, for the destruction of evidence and samples taken under this Act and the destruction, or removal from the DNA (Military Police) Database System, of any DNA profiles generated from those samples; to amend the Defence Act 1954, the Courts-Martial Appeals Act 1983 and the Criminal Justice (Forensic Evidence and DNA Database System) Act 2014; and to provide for related matters."
            },
            {
                "url": "https://www.irishstatutebook.ie/eli/2022/act/17/enacted/en/xml",
                "title": "EIRGRID, ELECTRICITY AND TURF (AMENDMENT) ACT 2022",
                "description": "An Act to provide for certain measures that may be taken pursuant to a direction of the Commission for Regulation of Utilities to provide for emergency measures for the purpose of ensuring and protecting security of supply of electricity; to provide for the giving of financial support by the Minister for the Environment, Climate and Communications to EirGrid to enable EirGrid to take certain measures, including acquiring electricity generation plant pursuant to a direction; to provide for the purchase by EirGrid of electricity generation plant; to provide for EirGrid entering into agreements with electricity generators in relation to electricity generation plant; to increase the amount of money that EirGrid may borrow and for that purpose to amend the Electricity Regulation (Amendment) (Eirgrid) Act 2008; to amend the Electricity Regulation Act 1999 to provide for payments to final customers of certain benefits relating to compliance with a public service obligation; to increase the amount of money that Bord na Móna may borrow and for that purpose to amend the Turf Development Act 1998; and to provide for related matters."
            },
            {
                "url": "https://www.irishstatutebook.ie/eli/2022/act/18/enacted/en/xml",
                "title": "INSTITUTIONAL BURIALS ACT 2022",
                "description": "An Act to provide for the appointment from time to time by the Government of a corporation sole, to be called a Director of Authorised Intervention, for the purposes of excavating land associated with an institution owned, operated, controlled or funded by a public body and, having regard to the need to accord dignity to persons buried in that land, recovering human remains buried in that land in a manifestly inappropriate manner; to provide for post-recovery analysis of recovered human remains; to provide, where appropriate, for the establishment of an Identification Programme; to provide for the participation of certain relatives of persons thought to be buried in the land concerned in the Programme; to provide for the establishment, by Forensic Science Ireland, of a DNA (Historic Remains) Database and a related Database for personal information for the purposes of that Programme; to provide for final arrangements for the human remains recovered from such land; for those and related purposes to enable a Director in certain circumstances to access and carry out works over principal burial land and ancillary burial land and, where necessary, on land ancillary to principal burial land and ancillary burial land and to provide for the payment of compensation in certain circumstances to persons for interference with an interest in or right over such land; to provide for the carrying out of remedial works on land when work on the land concerned is completed; to provide for the establishment of an Advisory Board to provide advice and guidance to a Director in the performance of his or her functions; to provide that a relevant Minister may make regulations, having regard to potential developments in forensic science, to enable forensic testing of samples in certain circumstances for the purposes of identification of human remains after an Identification Programme is completed; to provide, on the dissolution of an Office of Director, for the transfer of any remaining functions, rights, liabilities and records to a relevant Minister; to amend the Taxes Consolidation Act 1997 and the Planning and Development Act 2000; and to provide for related matters. [13th July, 2022]"
            },
            {
                "url": "https://www.irishstatutebook.ie/eli/2022/act/19/enacted/en/xml",
                "title": "CIVIL LAW (MISCELLANEOUS PROVISIONS) ACT 2022",
                "description": "An Act to make provision for certain matters relating to persons to whom permission to reside in the State is given under section 60(6) of the International Protection Act 2015; to provide for the making of a payment, in certain circumstances, to persons who provide accommodation to such persons; to provide for the making of certain payments in respect of the children of such persons, and for that purpose to amend the Childcare Support Act 2018; to provide for the recognition of certain driving licences held by such persons and for that purpose to amend the Road Traffic Acts 1961 and 2010; to make better provision in relation to the registration of non-nationals in the State and for that purpose to amend the Immigration Act 2004 and other enactments; to provide for the collection by specified persons of personal data of certain persons arriving in the State and to provide for the processing of that data in certain circumstances; to make provision for a scheme established and operated by the Minister for Transport to support certain road haulage operators; to make special provision relating to the jury at coroners inquests relating to the deaths of persons at the Stardust nightclub in the city of Dublin in 1981; and to provide for related matters."
            },
            {
                "url": "https://www.irishstatutebook.ie/eli/2022/act/20/enacted/en/xml",
                "title": "HEALTH (MISCELLANEOUS PROVISIONS) (NO. 2) ACT 2022",
                "description": "An Act to provide for certain exemptions from charges for acute in-patient services; to provide for the making available without charge of contraception services to women who have attained the age of 17 years but have not attained the age of 26 years; to provide that the Minister for Health may by regulations prescribe a further age or further classes, by reference to years of age, of women in respect of whom contraception services shall also be made available; and, for the foregoing purposes, to amend the Health Act 1970 and the Health (Pricing and Supply of Medical Goods) Act 2013; and to provide for related matters."
            },
            {
                "url": "https://www.irishstatutebook.ie/eli/2022/act/21/enacted/en/xml",
                "title": "CHILD CARE (AMENDMENT) ACT 2022",
                "description": "An Act to amend and extend the law in relation to guardians ad litem appointed under the Child Care Act 1991; to amend section 29 of the Child Care Act 1991 to allow officers of the Minister to attend, for specific purposes, proceedings heard otherwise than in public; and for those and other purposes to amend the Child Care Act 1991, the Children Act 2001, the Mental Health Act 2001, the National Vetting Bureau (Children and Vulnerable Persons) Act 2012 and the Children First Act 2015; to repeal certain provisions of the Child Care (Amendment) Act 2011; and to provide for related matters."
            },
            {
                "url": "https://www.irishstatutebook.ie/eli/2022/act/22/enacted/en/xml",
                "title": "EDUCATION (PROVISION IN RESPECT OF CHILDREN WITH SPECIAL EDUCATIONAL NEEDS) ACT 2022",
                "description": "An Act to make provision in respect of children with special educational needs; and for that purpose to provide for patrons and boards of management of schools to cooperate with the National Council for Special Education in the performance by the Council of its functions under the Education for Persons with Special Educational Needs Act 2004relating to the provision of education to children with special educational needs, including, in particular, by the provision and operation of a special class or classes when requested to do so by the Council; to provide for the giving of directions by the Minister for Education relating to provision for education for children with special educational needs and to provide for compliance with such directions; for those purposes to amend and extend the Education Act 1998 and to amend the Education for Persons with Special Educational Needs Act 2004; and to provide for related matters."
            },
            {
                "url": "https://www.irishstatutebook.ie/eli/2022/act/23/enacted/en/xml",
                "title": "PAYMENT OF WAGES (AMENDMENT) (TIPS AND GRATUITIES) ACT 2022",
                "description": "An Act to provide further protection for employees in relation to the payment of wages; to provide for the treatment of certain voluntary payments made to or left for employees and contract workers; to provide for obligations on employers relating to the fair distribution of certain tips and gratuities; to provide for obligations on employers and certain other persons to inform the public of the treatment of tips and gratuities and, for those purposes, to amend the Payment of Wages Act 1991, the Terms of Employment (Information) Act 1994 and the Workplace Relations Act 2015; and to provide for related matters."
            },
            {
                "url": "https://www.irishstatutebook.ie/eli/2022/act/24/enacted/en/xml",
                "title": "SICK LEAVE ACT 2022",
                "description": "An Act to provide that employees shall, subject to certain conditions, be entitled to up to and including 3 statutory sick leave days; to provide that the Minister may, subject to certain conditions, vary the number of statutory sick leave days; to provide that employees shall be entitled to payment, calculated in the prescribed manner, in respect of statutory sick leave; to make provision for the Labour Court, in certain circumstances, to exempt an employer from the provisions of this Act; to provide for the keeping of records; to amend the Workplace Relations Act 2015; and to provide for related matters."
            },
            {
                "url": "https://www.irishstatutebook.ie/eli/2022/act/25/enacted/en/xml",
                "title": "COMMUNICATIONS (RETENTION OF DATA) (AMENDMENT) ACT 2022",
                "description": "An Act to amend the Communications (Retention of Data) Act 2011; to provide for the retention in specified circumstances by providers of electronic communications services of certain data; to provide for the disclosure in specified circumstances of such data and to provide for related matters."
            },
            {
                "url": "https://www.irishstatutebook.ie/eli/2022/act/26/enacted/en/xml",
                "title": "Circular Economy and Miscellaneous Provisions Act 2022",
                "description": "An Act to provide for the making by the Minister for the Environment, Climate and Communications of a circular economy strategy; to provide for the establishment of the Circular Economy Fund; to make provision in relation to the Environment Fund; to provide for the establishment by the Environmental Protection Agency of a circular economy programme; to provide for a levy on certain single-use items; to provide for the prohibition on the supply of certain single-use items; to give further effect to Directive (EU) 2015/720 of the European Parliament and of the Council of 29 April 201511 O.J. No. L.115, 6.5.2015, p. 11 and Directive (EU) 2019/904 of the European Parliament and of the Council of 5 June 201922 O.J. No. L.155, 12.6.2019, p. 1; to provide for the making of a national food waste prevention strategy; to make provision for the use by local authorities of closed circuit television and mobile recording devices in certain circumstances and for that purpose to amend the Waste Management Act 1996 and the Litter Pollution Act 1997; to provide for the inclusion of targets in respect of re-used and repaired products and materials in waste management plans; to provide for the introduction of a requirement for segregated waste bins and incentivised charging for the commercial sector; to make provision in relation to the operation of the National Waste Collection Permit Office; to provide for a waste recovery levy; to provide for the making by the Minister for the Environment, Climate and Communications of regulations to regulate end-of-waste and by-product notifications to the Environmental Protection Agency; for the purpose of giving further effect to Directive 2008/98/EC of the European Parliament and of the Council of 19 November 200833 O.J. No. L.312, 22.11.2008, p. 3; for those purposes to amend the Waste Management Act 1996; to provide for a prohibition on certain licences relating to coal, lignite and oil shale and for that purpose to amend the Minerals Development Act 1940 and the Minerals Development Act 2017; to make provision in respect of applications to the Environmental Protection Agency for licences, reviews of licences or revised licences in circumstances where an order under section 181(2)(a) of the Planning and Development Act 2000 has been made, or is proposed to be made, by a Minister of the Government for development comprising or for the purposes of the activity to which the application relates and for that purpose to amend the Environmental Protection Agency Act 1992; to give further effect to Directive (EU) 2019/944 of the European Parliament and of the Council of 5 June 201944 O.J. No. L.158, 14.6.2019, p.125 and for that purpose to amend the Electricity Regulation Act 1999; and to provide for related matters."
            },
            {
                "url": "https://www.irishstatutebook.ie/eli/2022/act/27/enacted/en/xml",
                "title": "PROTECTED DISCLOSURES (AMENDMENT) ACT 2022",
                "description": "An Act to give effect to Directive (EU) 2019/1937 of the European Parliament and of the Council of 23 October 201911 OJ No. L 305, 26.11.2019, p. 17. on the protection of persons who report breaches of Union law and for that purpose to amend and extend the Protected Disclosures Act 2014; to provide for the establishment of the Office of the Protected Disclosures Commissioner and to confer functions on it; to amend the Freedom of Information Act 2014, the Ombudsman Act 1980 and the Workplace Relations Act 2015; and to provide for related matters."
            },
            {
                "url": "https://www.irishstatutebook.ie/eli/2022/act/28/enacted/en/xml",
                "title": "Remediation of Dwellings Damaged by the Use of Defective Concrete Blocks Act 2022",
                "description": "An Act to provide for the payment of grants for the remediation of certain dwellings damaged by the use of defective concrete blocks in their construction; to designate local authorities in whose areas affected dwellings are located; to provide for the amount of grants for remediation, alternative accommodation, storage and immediate repairs that may be paid and for variation of those amounts by Government order; to provide for procedures for application to a designated local authority for a grant and for determination by the Housing Agency of the application; to provide for time limits and conditions to attach to grants; to provide for certain second grants; to provide for refund of compensation received by owners of affected dwellings from third parties; to provide for recovery of grants in certain circumstances; to provide for charging orders for certain grants and their release; to provide for a scheme to enable remediation of designated local authority and approved housing body owned dwellings; to provide for an Appeals Panel and Appeal Board and procedures for appeals; to provide for authorised officers; to provide for revocation of the Dwellings Damaged by the Use of Defective Concrete Blocks in Construction (Remediation) (Financial Assistance) Regulations 2020 and necessary transitional arrangements; and to provide for related matters."
            },
            {
                "url": "https://www.irishstatutebook.ie/eli/2022/act/29/enacted/en/xml",
                "title": "Planning and Development, Maritime and Valuation (Amendment) Act 2022",
                "description": "An Act to amend the Planning and Development Act 2000; to provide that a person shall not advertise certain property in a rent pressure zone for letting for a period not exceeding 14 days; to provide for certain matters relating to Ministerial directions regarding development plans and local area plans and the related functions of the Office of the Planning Regulator; to provide for consultation before making applications for certain permissions for, and approvals of, the development of land and the maritime area in relation to details of such development that may not be confirmed at the time such applications are made; to provide for applications to be made to An Bord Pleanála in respect of development of lands where an application for substitute consent of development of those lands has been made, or in respect of development of lands adjoining those lands; to remove the requirement to apply for leave for substitute consent under Part XA of the Planning and Development Act 2000; to provide for certain matters relating to judicial review of decisions and acts of planning authorities, local authorities and An Bord Pleanla; to provide for the appointment of a chief executive designate to the Maritime Area Regulatory Authority and to provide for other matters relating to the maritime area, including matters relating to judicial review and rehabilitation schedules and for those and other purposes to amend the Maritime Area Planning Act 2021; to enable the Commissioner of Valuation with the consent of the Minister for Housing, Local Government and Heritage to revoke a valuation order in certain circumstances and for that purpose to amend the Valuation Act 2001; to extend the period within which a valuation list in relation to a rating authority shall be published and for that purpose to amend the Residential Tenancies and Valuation Act 2020; and to provide for related matters."
            },
            {
                "url": "https://www.irishstatutebook.ie/eli/2022/act/30/enacted/en/xml",
                "title": "Electoral Reform Act 2022",
                "description": "An Act to provide for the establishment of An Coimisiún Toghcháin; to confer on the Commission certain functions in relation to the preparation and maintenance of the Register of Political Parties; to provide that the Commission shall explain, to the public, the subject matter of referendums; to provide that the Commission shall provide information, to the public, on electoral processes and encourage participation, by the public, in the democratic processes of the State; to provide for the review, by the Commission, of constituencies for the election of members to Dil Éireann and to the European Parliament; to provide for the review, by the Commission, of local authority electoral area boundaries; to confer on the Commission a policy, research and advisory function; to provide that the Commission shall oversee the electoral register; to confer on the Commission the power to set standards for registration authorities and make recommendations to registration authorities or to the Minister in relation to the registration of electors; to modernise the arrangements for the registration of electors; to provide for continuous registration on the basis of individual application; to provide for necessary and appropriate data sharing to assist registration authorities in updating and maintaining the register; to provide for annual reporting by registration authorities to the Commission; to provide for a designated registration authority to manage a shared database for registration authorities to use in the performance of their functions; to provide for anonymous registration in certain limited cases; to provide a specific registration process for persons with no fixed address; to provide for a pending electors list for persons aged 16 and 17; to provide for the extension of postal voter categories to include special voters in certain circumstances; to provide a framework for the regulation of online political advertising during election periods by the Commission; to provide for the labelling of online political advertisements; to provide for transparency notices for online political advertisements; to confer on the Commission the power to monitor compliance, carry out investigations and take enforcement action under this Act in so far as it relates to online political advertising; to provide for a regulatory framework to protect the integrity of elections and referendums against the dissemination or publication of online disinformation, online misinformation and manipulative or inauthentic behaviour online; to facilitate elections during a pandemic or Covid-19; to provide for polling on the islands; to amend the Electoral Act 1997 to enhance transparency in relation to certain donations to political parties and to provide, inter alia, for the preparation by political parties of consolidated annual statements of accounts; to provide for the holding of fundraising lotteries by political parties; and to provide for related matters."
            },
            {
                "url": "https://www.irishstatutebook.ie/eli/2022/act/31/enacted/en/xml",
                "title": "HIGHER EDUCATION AUTHORITY ACT 2022",
                "description": "An Act to provide for changes to the functions and governance of An tÚdarás um Ard‑Oideachas and the oversight by it of higher education providers which are designated institutions of higher education under this Act; to provide for the preparation, review and amendment of a strategy for tertiary education; to provide for better engagement with students and equity of access to, and participation and the promotion of success in, higher education and lifelong and flexible learning; to provide for the designation of certain higher education providers as designated institutions of higher education and, if appropriate, the removal of such designation in certain circumstances; to amend the provisions regarding the composition of the governing authorities or governing bodies of certain designated institutions of higher education, including the Supplemental Letters Patent of 1911 in respect of Trinity College, Dublin; for those purposes, to repeal and replace the Higher Education Authority Act 1971 and to amend the Universities Act 1997, the Technological Universities Act 2018, the Regional Technical Colleges Act 1992, the Regional Technical Colleges (Amendment) Act 1994, the National College of Art and Design Act 1971, the Housing Finance Agency Act 1981, the Student Support Act 2011, the Industrial Training Act 1967, the Social Welfare Consolidation Act 2005, the Qualifications and Quality Assurance (Education and Training) Act 2012 and the National Treasury Management Agency (Amendment) Act 2014; and to provide for related matters. "
            },
            {
                "url": "https://www.irishstatutebook.ie/eli/2022/act/32/enacted/en/xml",
                "title": "ELECTRICITY COSTS (DOMESTIC ELECTRICITY ACCOUNTS) EMERGENCY MEASURES AND MISCELLANEOUS PROVISIONS ACT 2022",
                "description": "An Act to make provision, due to the continued exceptional rise in global energy prices since the completion of payments under the Electricity Costs Emergency Benefit Scheme, for the establishment of a further scheme to be known as the Electricity Costs Emergency Benefit Scheme II for the purpose of making further electricity costs emergency benefit payments during the period commencing on the date of the passing of this Act and ending on 30 June 2023 in respect of domestic electricity accounts in accordance with this Act out of resources available to the Minister for the Environment, Climate and Communications; for that purpose to confer functions on the distribution system operator and electricity suppliers; to confer functions on the Commission for Regulation of Utilities in relation to the Scheme and for that purpose to amend the Electricity Regulation Act 1999; to provide that these further electricity costs emergency benefit payments are exempt from income tax and for that purpose to amend the Taxes Consolidation Act 1997; to enable the Minister for the Environment, Climate and Communications to make regulations in relation to the operation of the Scheme; to make certain other amendments to the Electricity Regulation Act 1999 relating to registration under Part IIIA of that Act to give further effect to Directive (EU) 2019/944 of the European Parliament and of the Council of 5 June 20191 OJ No. L.158, 14.6.2019, p.125 on common rules for the internal market for electricity; to amend the rate of the levy under section 37 of the National Oil Reserves Agency Act 2007 for a certain period; and to provide for related matters."
            },
            {
                "url": "https://www.irishstatutebook.ie/eli/2022/act/33/enacted/en/xml",
                "title": "Garda Síochána (Compensation) Act 2022",
                "description": "An Act to establish a system to replace the system provided for under the Garda Síochána (Compensation) Acts 1941 to 2003 in order to provide for the granting out of public moneys of compensation for personal injuries (including injuries causing death) that were inflicted on a current or former member of the Garda Sochna as a result of a malicious incident; for that and related purposes to apply with modifications and to amend the Personal Injuries Assessment Board Act 2003, and to amend other enactments; to repeal the Garda Sochna (Compensation) Act 1941 and the Garda Sochna (Compensation) (Amendment) Act 1945; and to provide for related matters. "
            },
            {
                "url": "https://www.irishstatutebook.ie/eli/2022/act/34/enacted/en/xml",
                "title": "Residential Tenancies (Deferment of Termination Dates of Certain Tenancies) Act 2022",
                "description": "An Act to make emergency provision to defer the termination dates of certain tenancies that fall, or would fall, during the period beginning on the day after the date of the passing of this Act and ending on 31 March 2023 in order to mitigate the risk that persons whose tenancies would otherwise be terminated during that period would be unable to obtain alternative accommodation; to make such provision on a phased basis to enable tenancies affected to be terminated over a period of time to assist in managing demands on housing services as a result of such deferred termination; and to provide for related matters."
            },
            {
                "url": "https://www.irishstatutebook.ie/eli/2022/act/35/enacted/en/xml",
                "title": "DEVELOPMENT (EMERGENCY ELECTRICITY GENERATION) ACT 2022",
                "description": "An Act to provide for emergency measures for electricity generation development to ameliorate and protect security of supply of electricity in the State because exceptional circumstances have arisen in the market for that supply and further because of the situation in Ukraine; for disapplication of the Planning and Development Act 2000 for the purpose of such development; for such development to be exempt from the provisions of Directive No. 2011/92/EU of the European Parliament and of the Council of 13 December 201111 OJ No. L26, 28.1.2012, p.1 on the assessment of the effects of certain public and private projects on the environment amended by Directive 2014/52/EU of the European Parliament and of the Council of 16 April 201422 OJ No. L24, 25.4.2014, p.1, in accordance with Article 2(4) of that Directive; for application of arrangements for the alternative assessment of such development for the purposes of that Directive and the appropriate assessment of such development for the purposes of Council Directive 92/43/EEC of 21 May 199233 OJ No. L206, 22.7.1992, p.7  on the conservation of natural habitats and of wild fauna and flora, and for the co-ordination of such assessments; and to provide for related matters."
            },
            {
                "url": "https://www.irishstatutebook.ie/eli/2022/act/36/enacted/en/xml",
                "title": "Bretton Woods Agreements (Amendment) Act 2022",
                "description": "An Act to provide for Irelands participation in the Decision adopted by the Executive Board of the International Monetary Fund on New Arrangements to Borrow (NAB) whereby the State undertakes to provide resources to the International Monetary Fund by means of credit arrangements; to provide for guarantees by the Minister for Finance to the Central Bank of Ireland on any moneys advanced by it arising from a call by the International Monetary Fund under the NAB Decision; to provide for payments by the Minister for Finance out of the Central Fund to certain trust funds; to provide that the Minister for Finance may make a payment out of the Central Fund to the Central Bank of Ireland in respect of certain transactions; to amend the Bretton Woods Agreements Act 1957 in relation to the Catastrophe Containment and Relief Trust; to amend the Bretton Woods Agreements (Amendment) Act 1999 in relation to the Poverty Reduction and Growth Trust; to provide for certain other consequential amendments; and to provide for related matters."
            },
            {
                "url": "https://www.irishstatutebook.ie/eli/2022/act/37/enacted/en/xml",
                "title": "Consumer Rights Act 2022",
                "description": "An Act to amend and consolidate the law relating to rights and remedies in contracts between traders and consumers for the sale of goods and the supply of digital content and digital and other services, including by giving effect to Directive (EU) 2019/770 of the European Parliament and of the Council of 20 May 201911 OJ No. L 136, 22.5.2019, p.1 on certain aspects concerning contracts for the supply of digital content and digital services, Directive (EU) 2019/771 of the European Parliament and of the Council of 20 May 201922 OJ No. L 136, 22.5.2019, p.28 on certain aspects concerning contracts for the sale of goods, amending Regulation (EU) 2017/2394 and Directive 2009/22/EC, and repealing Directive 1999/44/EC and Articles 1, 3 and 4 of Directive (EU) 2019/2161 of the European Parliament and of the Council of 27 November 201933 OJ No. L 328, 18.12.2019, p.7 amending Council Directive 93/13/EEC and Directives 98/6/EC, 2005/29/EC and 2011/83/EU of the European Parliament and of the Council as regards the better enforcement and modernisation of Union consumer protection rules; to amend and consolidate the law relating to unfair terms in contracts between traders and consumers; to amend the Consumer Credit Act 1995 to make provision for rights and remedies in hire-purchase agreements and consumer-hire agreements; to amend section 12(13) of the Competition and Consumer Protection Act 2014; to amend section 459 of the Companies Act 2014; and to provide for related matters. "
            },
            {
                "url": "https://www.irishstatutebook.ie/eli/2022/act/38/enacted/en/xml",
                "title": "Credit Guarantee (Amendment) Act 2022",
                "description": "An Act to make provision in relation to the giving of guarantees by the Minister for Enterprise, Trade and Employment under the Credit Guarantee Act 2012 in accordance with a credit guarantee scheme made under that Act by that Minister of the Government in response to the economic difficulties resulting from the aggression against Ukraine by Russia; to place a monetary limit on the potential liability of that Minister of the Government in respect of such a credit guarantee scheme; to extend the classes of enterprise to which such a credit guarantee scheme may apply; and, for those purposes, to amend the Credit Guarantee Act 2012 and the Credit Guarantee (Amendment) Act 2016; to amend the Loan Guarantee Schemes Agreements (Strategic Banking Corporation of Ireland) Act 2021; and to provide for related matters."
            },
            {
                "url": "https://www.irishstatutebook.ie/eli/2022/act/39/enacted/en/xml",
                "title": "Water Services (Amendment) Act 2022",
                "description": "An Act to provide that Irish Water shall be known only as Uisce Éireann; to provide for the reorganisation of Uisce ireann, the separation of Uisce ireann from Ervia, the removal of Ervias functions relating to Uisce ireann, and for those purposes to make certain amendments to the Gas Act 1976, the Water Services Act 2013, the Water Services (No. 2) Act 2013, the Water Services Act 2017 and certain other enactments; to make further provision for the board and chief executive officer of Uisce ireann; to amend the accounting and reporting requirements of Uisce ireann; to provide for accountability by Uisce ireann to a Committee of Dáil ireann; to provide for the transfer of certain staff, rights and liabilities and records from Ervia to Uisce ireann; to provide for the dissolution of the Water Advisory Body; and to provide for matters connected therewith."
            },
            {
                "url": "https://www.irishstatutebook.ie/eli/2022/act/40/enacted/en/xml",
                "title": "Air Navigation and Transport Act 2022",
                "description": "An Act to provide for the formation of a company, to be known as Seirbhís  Aerloingseoireachta na hÉireann or, in the English language, the Irish Air Navigation Service, to provide air navigation services in relation to civil aviation, to define its functions and to provide for the conferral on it of certain functions of the Irish Aviation Authority; to provide for combining the aviation regulatory functions of the Irish Aviation Authority with the aviation regulatory functions of the Commission for Aviation Regulation; to make consequential and other amendments to the Irish Aviation Authority Act 1993; to amend the Aviation Regulation Act 2001 to confer powers on such Commission to review the market power of airport authorities and to enforce the European Communities (Dublin Airport Charges) Regulations 2011 (S.I. No. 116 of 2011); to enable the Minister for Transport to review the regulation of airport charges by such Commission; to provide for the dissolution of such Commission; to amend the Air Navigation and Transport (Amendment) Act 1998 to increase the aggregate at any one time of moneys that may be borrowed under section 13 of that Act in the case of daa and any of its subsidiaries; and to provide for related matters."
            },
            {
                "url": "https://www.irishstatutebook.ie/eli/2022/act/41/enacted/en/xml",
                "title": "ONLINE SAFETY AND MEDIA REGULATION ACT 2022",
                "description": "An Act to amend the Broadcasting Act 2009 to provide for the establishment of a body to be known as Coimisiún na Meán; to provide for the implementation of Directive 2010/13/EU of the European Parliament and of the Council of 10 March 201011 OJ No. L95, 15.4.2010, p.1 as amended by Directive (EU) 2018/1808 of the European Parliament and of the Council of 14 November 201822 OJ No. L303, 28.11.2018, p.69 ; for the purpose of fulfilling the States responsibilities under those Directives, or otherwise in the interests of the common good, to impose obligations on providers of broadcasting services and audiovisual on-demand media services, and to provide for the regulation of content available on relevant online services and harmful online content available on designated online services; to enable authorised officers of Coimisin na Men to carry out investigations for the purposes of ensuring compliance with obligations imposed on persons by or under this Act; to provide for sanctions to be imposed on persons for failure to comply with obligations imposed by or under this Act, including to enable Coimisin na Men to impose administrative financial sanctions on providers of broadcasting services, audiovisual on‑demand media services and designated online services for failure to comply with such obligations; to enable Coimisin na Men, for the purpose of meeting its expenses and its working capital requirements, to impose a levy on providers of broadcasting services, audiovisual on-demand media services and designated online services; to establish a register of providers of audiovisual on-demand media services; to enable Coimisin na Men to impose a levy on providers of audiovisual media services for the purposes of funding a scheme to support the production of European works; to enable Coimisin na Men to prepare a scheme for the provision of funds to local sound broadcasters and community broadcasters for the support of good professional journalistic practices; to provide for the dissolution of the Broadcasting Authority of Ireland and the transfer of its functions to Coimisin na Men; to otherwise amend and extend the Broadcasting Act 2009; to provide for the consequential amendment of certain other enactments; and to provide for related matters."
            },
            {
                "url": "https://www.irishstatutebook.ie/eli/2022/act/42/enacted/en/xml",
                "title": "Personal Injuries Resolution Board Act 2022",
                "description": "An Act to amend and extend the Personal Injuries Assessment Board Act 2003; to provide for the change of the name of the Personal Injuries Assessment Board to, in the Irish language, An Bord um Réiteach Díobhálacha Pearsanta and, in the English language, the Personal Injuries Resolution Board; to provide that the Board may make provision for a mediation process in respect of relevant claims; to provide that the Board may appoint mediators and may make rules in relation to the mediation process; to amend the procedures in relation to the assessment of claims where a long term prognosis is awaited, in relation to the imposition and charging of fees and in relation to costs in proceedings where an assessment has not been accepted by the claimant; to amend the functions of the Board; to provide for an offence of providing false or misleading information in certain circumstances; to amend the Freedom of Information Act 2014; and to provide for related matters. "
            },
            {
                "url": "https://www.irishstatutebook.ie/eli/2022/act/43/enacted/en/xml",
                "title": "SOCIAL WELFARE ACT 2022",
                "description": "An Act to amend and extend the Social Welfare Acts; to make a consequential amendment to the Taxes Consolidation Act 1997; and to provide for related matters."
            },
            {
                "url": "https://www.irishstatutebook.ie/eli/2022/act/44/enacted/en/xml",
                "title": "Finance Act 2022",
                "description": "An Act to provide for the imposition, repeal, remission, alteration and regulation of taxation, of stamp duties and of duties relating to excise and otherwise to make further provision in connection with finance including the regulation of customs; to make provision for supports to certain sectors of the economy; and to provide for related matters."
            },
            {
                "url": "https://www.irishstatutebook.ie/eli/2022/act/45/enacted/en/xml",
                "title": "APPROPRIATION ACT 2022",
                "description": "An Act to appropriate to the proper supply services and purposes sums granted by the Central Fund (Permanent Provisions) Act 1965, to make provision in relation to deferred surrender to the Central Fund of certain undischarged appropriations by reference to the capital supply services and purposes as provided for by section 91 of the Finance Act 2004 and, for the purpose of maintaining a sufficient amount of moneys in the Paymaster General's Supply Account so as to enable the discharge of particular liabilities, to make provision for repayable advances from the Central Fund."
            },
            {
                "url": "https://www.irishstatutebook.ie/eli/2022/act/46/enacted/en/xml",
                "title": "ASSISTED DECISION-MAKING (CAPACITY) (AMENDMENT) ACT 2022",
                "description": "An Act to give further effect to the Convention on the Rights of Persons with Disabilities done at New York on 13 December 2006; for that and other purposes to amend the Assisted Decision-Making (Capacity) Act 2015 ; to amend the Juries Act 1976 , the Electoral Act 1992 , the Courts and Court Officers Act 1995 , the Credit Union Act 1997 , the National Disability Authority Act 1999 , the Disability Act 2005 , the Nursing Homes Support Scheme Act 2009 , the Irish Human Rights and Equality Commission Act 2014  and the Freedom of Information Act 2014 ; and to provide for related matters."
            },
            {
                "url": "https://www.irishstatutebook.ie/eli/2022/act/47/enacted/en/xml",
                "title": "Planning and Development and Foreshore (Amendment) Act 2022",
                "description": "An Act to amend the Planning and Development Act 2000 in relation to the appointment of, and the efficient discharge of business of, An Bord Pleanála and, in order to facilitate and accelerate the provision of housing on lands owned by local authorities and certain state authorities, to provide that certain housing development on such lands be exempted development, and to amend the Foreshore Act 1933."
            },
            {
                "url": "https://www.irishstatutebook.ie/eli/2022/act/48/enacted/en/xml",
                "title": "Water Environment (Abstractions and Associated Impoundments) Act 2022",
                "description": "An Act to provide for the regulation of water abstractions and their associated impoundments; to give further effect to Directive 2000/60/EC of the European Parliament and of the Council of 23 October 200011 OJ No. L327, 22.12.2000, p.1 establishing a framework for Community action in the field of water policy; to provide for the Minister for Housing, Local Government and Heritage to regulate water abstractions not requiring a licence; to provide for the Minister to make regulations to exempt certain categories of water abstraction from certain requirements of the Act; to provide for the establishment of a register of water abstractions; to provide for licensing of water abstractions; to provide for the Minister to specify by order the daily rate of an abstraction that requires registration and licensing; to provide for the conferral of licensing and certain enforcement functions on the Environmental Protection Agency; to give further effect to Directive No. 2011/92/EU of the European Parliament and of the Council of 13 December 201122 OJ No. L26, 28.1.2012, p.1 on the assessment of the effects of certain public and private projects on the environment amended by Directive 2014/52/EU of the European Parliament and of the Council of 16 April 201433 OJ No. L24, 25.4.2014, p.1; to provide for Irish Water to carry out abstractions for the purpose of the performance of its functions; to provide for certain temporary and emergency abstractions required to be carried out by Irish Water and for those abstractions to be exempt from certain requirements of the Act; to provide for compensation for certain abstractions carried out by Irish Water; to provide for abstractions by Irish Water from reservoirs of the Electricity Supply Board; to provide for particular arrangements relating to abstractions from canals or navigable waters; to confer certain enforcement functions on local authorities; to repeal the Water Supplies Act 1942 and certain provisions of the Local Government (Sanitary Services) Act 1964 and the Local Government (Water Pollution) Act 1977 and to revoke the European Union (Water Policy) (Abstractions Registration) Regulations 2018 (S.I. No. 261 of 2018); to amend the Canals Act 1986, the Shannon Navigation Act 1990 and the Planning and Development Act 2000; and to provide for related matters. "
            },
            {
                "url": "https://www.irishstatutebook.ie/eli/2022/act/49/enacted/en/xml",
                "title": "HEALTH INSURANCE (AMENDMENT) ACT 2022",
                "description": "An Act to amend the Health Insurance Act 1994 to specify the amount of premium to be paid from the Risk Equalisation Fund in respect of certain classes of insured persons from 1 April 2023; to make certain other amendments to that Act, including making further provision for the appointment and powers of authorised officers; to make a consequential amendment to the Stamp Duties Consolidation Act 1999; and to provide for related matters. "
            },
            {
                "url": "https://www.irishstatutebook.ie/eli/2022/act/50/enacted/en/xml",
                "title": "TAILTE ÉIREANN ACT 2022",
                "description": "An Act to provide for the establishment of a body to be known as Tailte Éireann; to provide for the dissolution of the Property Registration Authority and Ordnance Survey Ireland and to provide for the transfer of their functions to Tailte ireann; to provide for the transfer of the functions of the Commissioner of Valuation and the Boundary Surveyor to Tailte ireann; to amend the Public Service Management Act 1997 , the Valuation Act 2001  and the Registration of Deeds and Title Act 2006 ; to provide for the repeal of certain enactments; and to provide for related matters. [21st December, 2022]"
            },
            {
                "url": "https://www.irishstatutebook.ie/eli/2022/act/51/enacted/en/xml",
                "title": "National Tourism Development Authority (Amendment) Act 2022",
                "description": "An Act to increase the aggregate of moneys that the National Tourism Development Authority may advance to enterprises and projects to which section 8(1)(e) of the National Tourism Development Authority Act 2003 applies and for that purpose to amend section 24 of the National Tourism Development Authority Act 2003."
            },
            {
                "url": "https://www.irishstatutebook.ie/eli/2022/act/52/enacted/en/xml",
                "title": "LOCAL GOVERNMENT (MATERNITY PROTECTION AND OTHER MEASURES FOR MEMBERS OF LOCAL AUTHORITIES) ACT 2022",
                "description": "An Act to amend the Maternity Protection Act 1994 to make available the leave entitlements afforded by that Act to members of local authorities; to amend the Local Government Act 2001 to, first, provide that a casual vacancy in the membership of a local authority does not arise when a member of the local authority is absent from the local authority due to taking leave in accordance with the Maternity Protection Act 1994 and, second, to permit, in certain circumstances, a person to temporarily take the place of a member of a local authority who is absent from the local authority for an extended period; and to provide for related matters. "
            }
        ]
    
